yangchengxcy/da14580/xcy_gump/src/modules/rf/api/reg_ripple.h
__INLINE void rpl_channel_setf(uint8_t channel)
{
    ASSERT_ERR((((uint32_t)channel << 8) & ~((uint32_t)0x00007F00)) == 0);
    REG_RPL_WR(RPL_RFDYNCNTL_ADDR, (REG_RPL_RD(RPL_RFDYNCNTL_ADDR) & ~((uint32_t)0x00007F00)) | ((uint32_t)channel << 8));
}

__INLINE uint8_t rpl_btle_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFDYNCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

__INLINE void rpl_btle_en_setf(uint8_t btleen)
{
    ASSERT_ERR((((uint32_t)btleen << 7) & ~((uint32_t)0x00000080)) == 0);
    REG_RPL_WR(RPL_RFDYNCNTL_ADDR, (REG_RPL_RD(RPL_RFDYNCNTL_ADDR) & ~((uint32_t)0x00000080)) | ((uint32_t)btleen << 7));
}

__INLINE uint8_t rpl_rx_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFDYNCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__INLINE void rpl_rx_en_setf(uint8_t rxen)
{
    ASSERT_ERR((((uint32_t)rxen << 4) & ~((uint32_t)0x00000010)) == 0);
    REG_RPL_WR(RPL_RFDYNCNTL_ADDR, (REG_RPL_RD(RPL_RFDYNCNTL_ADDR) & ~((uint32_t)0x00000010)) | ((uint32_t)rxen << 4));
}

__INLINE uint8_t rpl_tx_edr_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFDYNCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE void rpl_tx_edr_setf(uint8_t txedr)
{
    ASSERT_ERR((((uint32_t)txedr << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_RPL_WR(RPL_RFDYNCNTL_ADDR, (REG_RPL_RD(RPL_RFDYNCNTL_ADDR) & ~((uint32_t)0x00000002)) | ((uint32_t)txedr << 1));
}

__INLINE uint8_t rpl_tx_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFDYNCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void rpl_tx_en_setf(uint8_t txen)
{
    ASSERT_ERR((((uint32_t)txen << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_RFDYNCNTL_ADDR, (REG_RPL_RD(RPL_RFDYNCNTL_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)txen << 0));
}

/**
 * @brief SEQCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  27:24        RX_FLAG_CHECK   0x2
 *  20:16        RX_DIV_FACTOR   0x8
 *  11:08        TX_FLAG_CHECK   0x2
 *  04:00        TX_DIV_FACTOR   0x8
 * </pre>
 */
#define RPL_SEQCNTL_ADDR   0x00000002
#define RPL_SEQCNTL_OFFSET 0x00000002
#define RPL_SEQCNTL_INDEX  0x00000002
#define RPL_SEQCNTL_RESET  0x02080208

__INLINE uint32_t rpl_seqcntl_get(void)
{
    return REG_RPL_RD(RPL_SEQCNTL_ADDR);
}

__INLINE void rpl_seqcntl_set(uint32_t value)
{
    REG_RPL_WR(RPL_SEQCNTL_ADDR, value);
}

// field definitions
#define RPL_RX_FLAG_CHECK_MASK   ((uint32_t)0x0F000000)
#define RPL_RX_FLAG_CHECK_LSB    24
#define RPL_RX_FLAG_CHECK_WIDTH  ((uint32_t)0x00000004)
#define RPL_RX_DIV_FACTOR_MASK   ((uint32_t)0x001F0000)
#define RPL_RX_DIV_FACTOR_LSB    16
#define RPL_RX_DIV_FACTOR_WIDTH  ((uint32_t)0x00000005)
#define RPL_TX_FLAG_CHECK_MASK   ((uint32_t)0x00000F00)
#define RPL_TX_FLAG_CHECK_LSB    8
#define RPL_TX_FLAG_CHECK_WIDTH  ((uint32_t)0x00000004)
#define RPL_TX_DIV_FACTOR_MASK   ((uint32_t)0x0000001F)
#define RPL_TX_DIV_FACTOR_LSB    0
#define RPL_TX_DIV_FACTOR_WIDTH  ((uint32_t)0x00000005)

#define RPL_RX_FLAG_CHECK_RST    0x2
#define RPL_RX_DIV_FACTOR_RST    0x8
#define RPL_TX_FLAG_CHECK_RST    0x2
#define RPL_TX_DIV_FACTOR_RST    0x8

__INLINE void rpl_seqcntl_pack(uint8_t rxflagcheck, uint8_t rxdivfactor, uint8_t txflagcheck, uint8_t txdivfactor)
{
    ASSERT_ERR((((uint32_t)rxflagcheck << 24) & ~((uint32_t)0x0F000000)) == 0);
    ASSERT_ERR((((uint32_t)rxdivfactor << 16) & ~((uint32_t)0x001F0000)) == 0);
    ASSERT_ERR((((uint32_t)txflagcheck << 8) & ~((uint32_t)0x00000F00)) == 0);
    ASSERT_ERR((((uint32_t)txdivfactor << 0) & ~((uint32_t)0x0000001F)) == 0);
    REG_RPL_WR(RPL_SEQCNTL_ADDR,  ((uint32_t)rxflagcheck << 24) | ((uint32_t)rxdivfactor << 16) | ((uint32_t)txflagcheck << 8) | ((uint32_t)txdivfactor << 0));
}

__INLINE void rpl_seqcntl_unpack(uint8_t* rxflagcheck, uint8_t* rxdivfactor, uint8_t* txflagcheck, uint8_t* txdivfactor)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQCNTL_ADDR);

    *rxflagcheck = (localVal & ((uint32_t)0x0F000000)) >> 24;
    *rxdivfactor = (localVal & ((uint32_t)0x001F0000)) >> 16;
    *txflagcheck = (localVal & ((uint32_t)0x00000F00)) >> 8;
    *txdivfactor = (localVal & ((uint32_t)0x0000001F)) >> 0;
}

__INLINE uint8_t rpl_rx_flag_check_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQCNTL_ADDR);
    return ((localVal & ((uint32_t)0x0F000000)) >> 24);
}

__INLINE void rpl_rx_flag_check_setf(uint8_t rxflagcheck)
{
    ASSERT_ERR((((uint32_t)rxflagcheck << 24) & ~((uint32_t)0x0F000000)) == 0);
    REG_RPL_WR(RPL_SEQCNTL_ADDR, (REG_RPL_RD(RPL_SEQCNTL_ADDR) & ~((uint32_t)0x0F000000)) | ((uint32_t)rxflagcheck << 24));
}

__INLINE uint8_t rpl_rx_div_factor_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQCNTL_ADDR);
    return ((localVal & ((uint32_t)0x001F0000)) >> 16);
}

__INLINE void rpl_rx_div_factor_setf(uint8_t rxdivfactor)
{
    ASSERT_ERR((((uint32_t)rxdivfactor << 16) & ~((uint32_t)0x001F0000)) == 0);
    REG_RPL_WR(RPL_SEQCNTL_ADDR, (REG_RPL_RD(RPL_SEQCNTL_ADDR) & ~((uint32_t)0x001F0000)) | ((uint32_t)rxdivfactor << 16));
}

__INLINE uint8_t rpl_tx_flag_check_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000F00)) >> 8);
}

__INLINE void rpl_tx_flag_check_setf(uint8_t txflagcheck)
{
    ASSERT_ERR((((uint32_t)txflagcheck << 8) & ~((uint32_t)0x00000F00)) == 0);
    REG_RPL_WR(RPL_SEQCNTL_ADDR, (REG_RPL_RD(RPL_SEQCNTL_ADDR) & ~((uint32_t)0x00000F00)) | ((uint32_t)txflagcheck << 8));
}

__INLINE uint8_t rpl_tx_div_factor_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQCNTL_ADDR);
    return ((localVal & ((uint32_t)0x0000001F)) >> 0);
}

__INLINE void rpl_tx_div_factor_setf(uint8_t txdivfactor)
{
    ASSERT_ERR((((uint32_t)txdivfactor << 0) & ~((uint32_t)0x0000001F)) == 0);
    REG_RPL_WR(RPL_SEQCNTL_ADDR, (REG_RPL_RD(RPL_SEQCNTL_ADDR) & ~((uint32_t)0x0000001F)) | ((uint32_t)txdivfactor << 0));
}

/**
 * @brief RFTXUP_DLY0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:22           TX_UP_DLY2   0x19
 *  20:11           TX_UP_DLY1   0x206
 *  09:00           TX_UP_DLY0   0x1
 * </pre>
 */
#define RPL_RFTXUP_DLY0_ADDR   0x00000003
#define RPL_RFTXUP_DLY0_OFFSET 0x00000003
#define RPL_RFTXUP_DLY0_INDEX  0x00000003
#define RPL_RFTXUP_DLY0_RESET  0x06503001

