yangchengxcy/da14580/xcy_gump/src/modules/rf/api/reg_ripple.h
// field definitions
#define RPL_TX_UP_DLY8_MASK   ((uint32_t)0xFFC00000)
#define RPL_TX_UP_DLY8_LSB    22
#define RPL_TX_UP_DLY8_WIDTH  ((uint32_t)0x0000000A)
#define RPL_TX_UP_DLY7_MASK   ((uint32_t)0x001FF800)
#define RPL_TX_UP_DLY7_LSB    11
#define RPL_TX_UP_DLY7_WIDTH  ((uint32_t)0x0000000A)
#define RPL_TX_UP_DLY6_MASK   ((uint32_t)0x000003FF)
#define RPL_TX_UP_DLY6_LSB    0
#define RPL_TX_UP_DLY6_WIDTH  ((uint32_t)0x0000000A)

#define RPL_TX_UP_DLY8_RST    0x1
#define RPL_TX_UP_DLY7_RST    0x1
#define RPL_TX_UP_DLY6_RST    0x1

__INLINE void rpl_rftxup_dly2_pack(uint16_t txupdly8, uint16_t txupdly7, uint16_t txupdly6)
{
    ASSERT_ERR((((uint32_t)txupdly8 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    ASSERT_ERR((((uint32_t)txupdly7 << 11) & ~((uint32_t)0x001FF800)) == 0);
    ASSERT_ERR((((uint32_t)txupdly6 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFTXUP_DLY2_ADDR,  ((uint32_t)txupdly8 << 22) | ((uint32_t)txupdly7 << 11) | ((uint32_t)txupdly6 << 0));
}

__INLINE void rpl_rftxup_dly2_unpack(uint16_t* txupdly8, uint16_t* txupdly7, uint16_t* txupdly6)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXUP_DLY2_ADDR);

    *txupdly8 = (localVal & ((uint32_t)0xFFC00000)) >> 22;
    *txupdly7 = (localVal & ((uint32_t)0x001FF800)) >> 11;
    *txupdly6 = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__INLINE uint16_t rpl_tx_up_dly8_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXUP_DLY2_ADDR);
    return ((localVal & ((uint32_t)0xFFC00000)) >> 22);
}

__INLINE void rpl_tx_up_dly8_setf(uint16_t txupdly8)
{
    ASSERT_ERR((((uint32_t)txupdly8 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    REG_RPL_WR(RPL_RFTXUP_DLY2_ADDR, (REG_RPL_RD(RPL_RFTXUP_DLY2_ADDR) & ~((uint32_t)0xFFC00000)) | ((uint32_t)txupdly8 << 22));
}

__INLINE uint16_t rpl_tx_up_dly7_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXUP_DLY2_ADDR);
    return ((localVal & ((uint32_t)0x001FF800)) >> 11);
}

__INLINE void rpl_tx_up_dly7_setf(uint16_t txupdly7)
{
    ASSERT_ERR((((uint32_t)txupdly7 << 11) & ~((uint32_t)0x001FF800)) == 0);
    REG_RPL_WR(RPL_RFTXUP_DLY2_ADDR, (REG_RPL_RD(RPL_RFTXUP_DLY2_ADDR) & ~((uint32_t)0x001FF800)) | ((uint32_t)txupdly7 << 11));
}

__INLINE uint16_t rpl_tx_up_dly6_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXUP_DLY2_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

__INLINE void rpl_tx_up_dly6_setf(uint16_t txupdly6)
{
    ASSERT_ERR((((uint32_t)txupdly6 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFTXUP_DLY2_ADDR, (REG_RPL_RD(RPL_RFTXUP_DLY2_ADDR) & ~((uint32_t)0x000003FF)) | ((uint32_t)txupdly6 << 0));
}

/**
 * @brief RFTXDN_DLY0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:22           TX_DN_DLY2   0x1
 *  20:11           TX_DN_DLY1   0x19
 *  09:00           TX_DN_DLY0   0x19
 * </pre>
 */
#define RPL_RFTXDN_DLY0_ADDR   0x00000006
#define RPL_RFTXDN_DLY0_OFFSET 0x00000006
#define RPL_RFTXDN_DLY0_INDEX  0x00000006
#define RPL_RFTXDN_DLY0_RESET  0x0040C819

__INLINE uint32_t rpl_rftxdn_dly0_get(void)
{
    return REG_RPL_RD(RPL_RFTXDN_DLY0_ADDR);
}

__INLINE void rpl_rftxdn_dly0_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFTXDN_DLY0_ADDR, value);
}

// field definitions
#define RPL_TX_DN_DLY2_MASK   ((uint32_t)0xFFC00000)
#define RPL_TX_DN_DLY2_LSB    22
#define RPL_TX_DN_DLY2_WIDTH  ((uint32_t)0x0000000A)
#define RPL_TX_DN_DLY1_MASK   ((uint32_t)0x001FF800)
#define RPL_TX_DN_DLY1_LSB    11
#define RPL_TX_DN_DLY1_WIDTH  ((uint32_t)0x0000000A)
#define RPL_TX_DN_DLY0_MASK   ((uint32_t)0x000003FF)
#define RPL_TX_DN_DLY0_LSB    0
#define RPL_TX_DN_DLY0_WIDTH  ((uint32_t)0x0000000A)

#define RPL_TX_DN_DLY2_RST    0x1
#define RPL_TX_DN_DLY1_RST    0x19
#define RPL_TX_DN_DLY0_RST    0x19

__INLINE void rpl_rftxdn_dly0_pack(uint16_t txdndly2, uint16_t txdndly1, uint16_t txdndly0)
{
    ASSERT_ERR((((uint32_t)txdndly2 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    ASSERT_ERR((((uint32_t)txdndly1 << 11) & ~((uint32_t)0x001FF800)) == 0);
    ASSERT_ERR((((uint32_t)txdndly0 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFTXDN_DLY0_ADDR,  ((uint32_t)txdndly2 << 22) | ((uint32_t)txdndly1 << 11) | ((uint32_t)txdndly0 << 0));
}

__INLINE void rpl_rftxdn_dly0_unpack(uint16_t* txdndly2, uint16_t* txdndly1, uint16_t* txdndly0)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXDN_DLY0_ADDR);

    *txdndly2 = (localVal & ((uint32_t)0xFFC00000)) >> 22;
    *txdndly1 = (localVal & ((uint32_t)0x001FF800)) >> 11;
    *txdndly0 = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__INLINE uint16_t rpl_tx_dn_dly2_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXDN_DLY0_ADDR);
    return ((localVal & ((uint32_t)0xFFC00000)) >> 22);
}

__INLINE void rpl_tx_dn_dly2_setf(uint16_t txdndly2)
{
    ASSERT_ERR((((uint32_t)txdndly2 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    REG_RPL_WR(RPL_RFTXDN_DLY0_ADDR, (REG_RPL_RD(RPL_RFTXDN_DLY0_ADDR) & ~((uint32_t)0xFFC00000)) | ((uint32_t)txdndly2 << 22));
}

__INLINE uint16_t rpl_tx_dn_dly1_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXDN_DLY0_ADDR);
    return ((localVal & ((uint32_t)0x001FF800)) >> 11);
}

__INLINE void rpl_tx_dn_dly1_setf(uint16_t txdndly1)
{
    ASSERT_ERR((((uint32_t)txdndly1 << 11) & ~((uint32_t)0x001FF800)) == 0);
    REG_RPL_WR(RPL_RFTXDN_DLY0_ADDR, (REG_RPL_RD(RPL_RFTXDN_DLY0_ADDR) & ~((uint32_t)0x001FF800)) | ((uint32_t)txdndly1 << 11));
}

__INLINE uint16_t rpl_tx_dn_dly0_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXDN_DLY0_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

__INLINE void rpl_tx_dn_dly0_setf(uint16_t txdndly0)
{
    ASSERT_ERR((((uint32_t)txdndly0 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFTXDN_DLY0_ADDR, (REG_RPL_RD(RPL_RFTXDN_DLY0_ADDR) & ~((uint32_t)0x000003FF)) | ((uint32_t)txdndly0 << 0));
}

/**
 * @brief RFTXDN_DLY1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:22           TX_DN_DLY5   0x1
 *  20:11           TX_DN_DLY4   0x1
 *  09:00           TX_DN_DLY3   0x1
 * </pre>
 */
#define RPL_RFTXDN_DLY1_ADDR   0x00000007
#define RPL_RFTXDN_DLY1_OFFSET 0x00000007
#define RPL_RFTXDN_DLY1_INDEX  0x00000007
#define RPL_RFTXDN_DLY1_RESET  0x00400801

__INLINE uint32_t rpl_rftxdn_dly1_get(void)
{
    return REG_RPL_RD(RPL_RFTXDN_DLY1_ADDR);
}

__INLINE void rpl_rftxdn_dly1_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFTXDN_DLY1_ADDR, value);
}

