yangchengxcy/da14580/xcy_gump/src/modules/rf/api/reg_ripple.h
// field definitions
#define RPL_TX_DN_OUT5_MASK   ((uint32_t)0x7FC00000)
#define RPL_TX_DN_OUT5_LSB    22
#define RPL_TX_DN_OUT5_WIDTH  ((uint32_t)0x00000009)
#define RPL_TX_DN_OUT4_MASK   ((uint32_t)0x000FF800)
#define RPL_TX_DN_OUT4_LSB    11
#define RPL_TX_DN_OUT4_WIDTH  ((uint32_t)0x00000009)
#define RPL_TX_DN_OUT3_MASK   ((uint32_t)0x000001FF)
#define RPL_TX_DN_OUT3_LSB    0
#define RPL_TX_DN_OUT3_WIDTH  ((uint32_t)0x00000009)

#define RPL_TX_DN_OUT5_RST    0x0
#define RPL_TX_DN_OUT4_RST    0x0
#define RPL_TX_DN_OUT3_RST    0x1

__INLINE void rpl_seqtxdn_out1_pack(uint16_t txdnout5, uint16_t txdnout4, uint16_t txdnout3)
{
    ASSERT_ERR((((uint32_t)txdnout5 << 22) & ~((uint32_t)0x7FC00000)) == 0);
    ASSERT_ERR((((uint32_t)txdnout4 << 11) & ~((uint32_t)0x000FF800)) == 0);
    ASSERT_ERR((((uint32_t)txdnout3 << 0) & ~((uint32_t)0x000001FF)) == 0);
    REG_RPL_WR(RPL_SEQTXDN_OUT1_ADDR,  ((uint32_t)txdnout5 << 22) | ((uint32_t)txdnout4 << 11) | ((uint32_t)txdnout3 << 0));
}

__INLINE void rpl_seqtxdn_out1_unpack(uint16_t* txdnout5, uint16_t* txdnout4, uint16_t* txdnout3)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQTXDN_OUT1_ADDR);

    *txdnout5 = (localVal & ((uint32_t)0x7FC00000)) >> 22;
    *txdnout4 = (localVal & ((uint32_t)0x000FF800)) >> 11;
    *txdnout3 = (localVal & ((uint32_t)0x000001FF)) >> 0;
}

__INLINE uint16_t rpl_tx_dn_out5_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQTXDN_OUT1_ADDR);
    return ((localVal & ((uint32_t)0x7FC00000)) >> 22);
}

__INLINE void rpl_tx_dn_out5_setf(uint16_t txdnout5)
{
    ASSERT_ERR((((uint32_t)txdnout5 << 22) & ~((uint32_t)0x7FC00000)) == 0);
    REG_RPL_WR(RPL_SEQTXDN_OUT1_ADDR, (REG_RPL_RD(RPL_SEQTXDN_OUT1_ADDR) & ~((uint32_t)0x7FC00000)) | ((uint32_t)txdnout5 << 22));
}

__INLINE uint16_t rpl_tx_dn_out4_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQTXDN_OUT1_ADDR);
    return ((localVal & ((uint32_t)0x000FF800)) >> 11);
}

__INLINE void rpl_tx_dn_out4_setf(uint16_t txdnout4)
{
    ASSERT_ERR((((uint32_t)txdnout4 << 11) & ~((uint32_t)0x000FF800)) == 0);
    REG_RPL_WR(RPL_SEQTXDN_OUT1_ADDR, (REG_RPL_RD(RPL_SEQTXDN_OUT1_ADDR) & ~((uint32_t)0x000FF800)) | ((uint32_t)txdnout4 << 11));
}

__INLINE uint16_t rpl_tx_dn_out3_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQTXDN_OUT1_ADDR);
    return ((localVal & ((uint32_t)0x000001FF)) >> 0);
}

__INLINE void rpl_tx_dn_out3_setf(uint16_t txdnout3)
{
    ASSERT_ERR((((uint32_t)txdnout3 << 0) & ~((uint32_t)0x000001FF)) == 0);
    REG_RPL_WR(RPL_SEQTXDN_OUT1_ADDR, (REG_RPL_RD(RPL_SEQTXDN_OUT1_ADDR) & ~((uint32_t)0x000001FF)) | ((uint32_t)txdnout3 << 0));
}

/**
 * @brief SEQTXDN_OUT2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  30:22           TX_DN_OUT8   0x0
 *  19:11           TX_DN_OUT7   0x0
 *  08:00           TX_DN_OUT6   0x0
 * </pre>
 */
#define RPL_SEQTXDN_OUT2_ADDR   0x00000014
#define RPL_SEQTXDN_OUT2_OFFSET 0x00000014
#define RPL_SEQTXDN_OUT2_INDEX  0x00000014
#define RPL_SEQTXDN_OUT2_RESET  0x00000000

__INLINE uint32_t rpl_seqtxdn_out2_get(void)
{
    return REG_RPL_RD(RPL_SEQTXDN_OUT2_ADDR);
}

__INLINE void rpl_seqtxdn_out2_set(uint32_t value)
{
    REG_RPL_WR(RPL_SEQTXDN_OUT2_ADDR, value);
}

// field definitions
#define RPL_TX_DN_OUT8_MASK   ((uint32_t)0x7FC00000)
#define RPL_TX_DN_OUT8_LSB    22
#define RPL_TX_DN_OUT8_WIDTH  ((uint32_t)0x00000009)
#define RPL_TX_DN_OUT7_MASK   ((uint32_t)0x000FF800)
#define RPL_TX_DN_OUT7_LSB    11
#define RPL_TX_DN_OUT7_WIDTH  ((uint32_t)0x00000009)
#define RPL_TX_DN_OUT6_MASK   ((uint32_t)0x000001FF)
#define RPL_TX_DN_OUT6_LSB    0
#define RPL_TX_DN_OUT6_WIDTH  ((uint32_t)0x00000009)

#define RPL_TX_DN_OUT8_RST    0x0
#define RPL_TX_DN_OUT7_RST    0x0
#define RPL_TX_DN_OUT6_RST    0x0

__INLINE void rpl_seqtxdn_out2_pack(uint16_t txdnout8, uint16_t txdnout7, uint16_t txdnout6)
{
    ASSERT_ERR((((uint32_t)txdnout8 << 22) & ~((uint32_t)0x7FC00000)) == 0);
    ASSERT_ERR((((uint32_t)txdnout7 << 11) & ~((uint32_t)0x000FF800)) == 0);
    ASSERT_ERR((((uint32_t)txdnout6 << 0) & ~((uint32_t)0x000001FF)) == 0);
    REG_RPL_WR(RPL_SEQTXDN_OUT2_ADDR,  ((uint32_t)txdnout8 << 22) | ((uint32_t)txdnout7 << 11) | ((uint32_t)txdnout6 << 0));
}

__INLINE void rpl_seqtxdn_out2_unpack(uint16_t* txdnout8, uint16_t* txdnout7, uint16_t* txdnout6)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQTXDN_OUT2_ADDR);

    *txdnout8 = (localVal & ((uint32_t)0x7FC00000)) >> 22;
    *txdnout7 = (localVal & ((uint32_t)0x000FF800)) >> 11;
    *txdnout6 = (localVal & ((uint32_t)0x000001FF)) >> 0;
}

__INLINE uint16_t rpl_tx_dn_out8_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQTXDN_OUT2_ADDR);
    return ((localVal & ((uint32_t)0x7FC00000)) >> 22);
}

__INLINE void rpl_tx_dn_out8_setf(uint16_t txdnout8)
{
    ASSERT_ERR((((uint32_t)txdnout8 << 22) & ~((uint32_t)0x7FC00000)) == 0);
    REG_RPL_WR(RPL_SEQTXDN_OUT2_ADDR, (REG_RPL_RD(RPL_SEQTXDN_OUT2_ADDR) & ~((uint32_t)0x7FC00000)) | ((uint32_t)txdnout8 << 22));
}

__INLINE uint16_t rpl_tx_dn_out7_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQTXDN_OUT2_ADDR);
    return ((localVal & ((uint32_t)0x000FF800)) >> 11);
}

__INLINE void rpl_tx_dn_out7_setf(uint16_t txdnout7)
{
    ASSERT_ERR((((uint32_t)txdnout7 << 11) & ~((uint32_t)0x000FF800)) == 0);
    REG_RPL_WR(RPL_SEQTXDN_OUT2_ADDR, (REG_RPL_RD(RPL_SEQTXDN_OUT2_ADDR) & ~((uint32_t)0x000FF800)) | ((uint32_t)txdnout7 << 11));
}

__INLINE uint16_t rpl_tx_dn_out6_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQTXDN_OUT2_ADDR);
    return ((localVal & ((uint32_t)0x000001FF)) >> 0);
}

__INLINE void rpl_tx_dn_out6_setf(uint16_t txdnout6)
{
    ASSERT_ERR((((uint32_t)txdnout6 << 0) & ~((uint32_t)0x000001FF)) == 0);
    REG_RPL_WR(RPL_SEQTXDN_OUT2_ADDR, (REG_RPL_RD(RPL_SEQTXDN_OUT2_ADDR) & ~((uint32_t)0x000001FF)) | ((uint32_t)txdnout6 << 0));
}

/**
 * @brief SEQRXUP_OUT0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  30:22           RX_UP_OUT2   0x7
 *  19:11           RX_UP_OUT1   0x3
 *  08:00           RX_UP_OUT0   0x1
 * </pre>
 */
#define RPL_SEQRXUP_OUT0_ADDR   0x00000015
#define RPL_SEQRXUP_OUT0_OFFSET 0x00000015
#define RPL_SEQRXUP_OUT0_INDEX  0x00000015
#define RPL_SEQRXUP_OUT0_RESET  0x01C01801

__INLINE uint32_t rpl_seqrxup_out0_get(void)
{
    return REG_RPL_RD(RPL_SEQRXUP_OUT0_ADDR);
}

__INLINE void rpl_seqrxup_out0_set(uint32_t value)
{
    REG_RPL_WR(RPL_SEQRXUP_OUT0_ADDR, value);
}

