yangchengxcy/da14580/xcy_gump/src/modules/rf/api/reg_ripple.h
__INLINE void rpl_seqrxup_out2_set(uint32_t value)
{
    REG_RPL_WR(RPL_SEQRXUP_OUT2_ADDR, value);
}

// field definitions
#define RPL_RX_UP_OUT8_MASK   ((uint32_t)0x7FC00000)
#define RPL_RX_UP_OUT8_LSB    22
#define RPL_RX_UP_OUT8_WIDTH  ((uint32_t)0x00000009)
#define RPL_RX_UP_OUT7_MASK   ((uint32_t)0x000FF800)
#define RPL_RX_UP_OUT7_LSB    11
#define RPL_RX_UP_OUT7_WIDTH  ((uint32_t)0x00000009)
#define RPL_RX_UP_OUT6_MASK   ((uint32_t)0x000001FF)
#define RPL_RX_UP_OUT6_LSB    0
#define RPL_RX_UP_OUT6_WIDTH  ((uint32_t)0x00000009)

#define RPL_RX_UP_OUT8_RST    0x1F
#define RPL_RX_UP_OUT7_RST    0x1F
#define RPL_RX_UP_OUT6_RST    0x1F

__INLINE void rpl_seqrxup_out2_pack(uint16_t rxupout8, uint16_t rxupout7, uint16_t rxupout6)
{
    ASSERT_ERR((((uint32_t)rxupout8 << 22) & ~((uint32_t)0x7FC00000)) == 0);
    ASSERT_ERR((((uint32_t)rxupout7 << 11) & ~((uint32_t)0x000FF800)) == 0);
    ASSERT_ERR((((uint32_t)rxupout6 << 0) & ~((uint32_t)0x000001FF)) == 0);
    REG_RPL_WR(RPL_SEQRXUP_OUT2_ADDR,  ((uint32_t)rxupout8 << 22) | ((uint32_t)rxupout7 << 11) | ((uint32_t)rxupout6 << 0));
}

__INLINE void rpl_seqrxup_out2_unpack(uint16_t* rxupout8, uint16_t* rxupout7, uint16_t* rxupout6)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQRXUP_OUT2_ADDR);

    *rxupout8 = (localVal & ((uint32_t)0x7FC00000)) >> 22;
    *rxupout7 = (localVal & ((uint32_t)0x000FF800)) >> 11;
    *rxupout6 = (localVal & ((uint32_t)0x000001FF)) >> 0;
}

__INLINE uint16_t rpl_rx_up_out8_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQRXUP_OUT2_ADDR);
    return ((localVal & ((uint32_t)0x7FC00000)) >> 22);
}

__INLINE void rpl_rx_up_out8_setf(uint16_t rxupout8)
{
    ASSERT_ERR((((uint32_t)rxupout8 << 22) & ~((uint32_t)0x7FC00000)) == 0);
    REG_RPL_WR(RPL_SEQRXUP_OUT2_ADDR, (REG_RPL_RD(RPL_SEQRXUP_OUT2_ADDR) & ~((uint32_t)0x7FC00000)) | ((uint32_t)rxupout8 << 22));
}

__INLINE uint16_t rpl_rx_up_out7_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQRXUP_OUT2_ADDR);
    return ((localVal & ((uint32_t)0x000FF800)) >> 11);
}

__INLINE void rpl_rx_up_out7_setf(uint16_t rxupout7)
{
    ASSERT_ERR((((uint32_t)rxupout7 << 11) & ~((uint32_t)0x000FF800)) == 0);
    REG_RPL_WR(RPL_SEQRXUP_OUT2_ADDR, (REG_RPL_RD(RPL_SEQRXUP_OUT2_ADDR) & ~((uint32_t)0x000FF800)) | ((uint32_t)rxupout7 << 11));
}

__INLINE uint16_t rpl_rx_up_out6_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQRXUP_OUT2_ADDR);
    return ((localVal & ((uint32_t)0x000001FF)) >> 0);
}

__INLINE void rpl_rx_up_out6_setf(uint16_t rxupout6)
{
    ASSERT_ERR((((uint32_t)rxupout6 << 0) & ~((uint32_t)0x000001FF)) == 0);
    REG_RPL_WR(RPL_SEQRXUP_OUT2_ADDR, (REG_RPL_RD(RPL_SEQRXUP_OUT2_ADDR) & ~((uint32_t)0x000001FF)) | ((uint32_t)rxupout6 << 0));
}

/**
 * @brief SEQRXDN_OUT0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  30:22           RX_DN_OUT2   0x3
 *  19:11           RX_DN_OUT1   0x7
 *  08:00           RX_DN_OUT0   0xF
 * </pre>
 */
#define RPL_SEQRXDN_OUT0_ADDR   0x00000018
#define RPL_SEQRXDN_OUT0_OFFSET 0x00000018
#define RPL_SEQRXDN_OUT0_INDEX  0x00000018
#define RPL_SEQRXDN_OUT0_RESET  0x00C0380F

__INLINE uint32_t rpl_seqrxdn_out0_get(void)
{
    return REG_RPL_RD(RPL_SEQRXDN_OUT0_ADDR);
}

__INLINE void rpl_seqrxdn_out0_set(uint32_t value)
{
    REG_RPL_WR(RPL_SEQRXDN_OUT0_ADDR, value);
}

// field definitions
#define RPL_RX_DN_OUT2_MASK   ((uint32_t)0x7FC00000)
#define RPL_RX_DN_OUT2_LSB    22
#define RPL_RX_DN_OUT2_WIDTH  ((uint32_t)0x00000009)
#define RPL_RX_DN_OUT1_MASK   ((uint32_t)0x000FF800)
#define RPL_RX_DN_OUT1_LSB    11
#define RPL_RX_DN_OUT1_WIDTH  ((uint32_t)0x00000009)
#define RPL_RX_DN_OUT0_MASK   ((uint32_t)0x000001FF)
#define RPL_RX_DN_OUT0_LSB    0
#define RPL_RX_DN_OUT0_WIDTH  ((uint32_t)0x00000009)

#define RPL_RX_DN_OUT2_RST    0x3
#define RPL_RX_DN_OUT1_RST    0x7
#define RPL_RX_DN_OUT0_RST    0xF

__INLINE void rpl_seqrxdn_out0_pack(uint16_t rxdnout2, uint16_t rxdnout1, uint16_t rxdnout0)
{
    ASSERT_ERR((((uint32_t)rxdnout2 << 22) & ~((uint32_t)0x7FC00000)) == 0);
    ASSERT_ERR((((uint32_t)rxdnout1 << 11) & ~((uint32_t)0x000FF800)) == 0);
    ASSERT_ERR((((uint32_t)rxdnout0 << 0) & ~((uint32_t)0x000001FF)) == 0);
    REG_RPL_WR(RPL_SEQRXDN_OUT0_ADDR,  ((uint32_t)rxdnout2 << 22) | ((uint32_t)rxdnout1 << 11) | ((uint32_t)rxdnout0 << 0));
}

__INLINE void rpl_seqrxdn_out0_unpack(uint16_t* rxdnout2, uint16_t* rxdnout1, uint16_t* rxdnout0)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQRXDN_OUT0_ADDR);

    *rxdnout2 = (localVal & ((uint32_t)0x7FC00000)) >> 22;
    *rxdnout1 = (localVal & ((uint32_t)0x000FF800)) >> 11;
    *rxdnout0 = (localVal & ((uint32_t)0x000001FF)) >> 0;
}

__INLINE uint16_t rpl_rx_dn_out2_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQRXDN_OUT0_ADDR);
    return ((localVal & ((uint32_t)0x7FC00000)) >> 22);
}

__INLINE void rpl_rx_dn_out2_setf(uint16_t rxdnout2)
{
    ASSERT_ERR((((uint32_t)rxdnout2 << 22) & ~((uint32_t)0x7FC00000)) == 0);
    REG_RPL_WR(RPL_SEQRXDN_OUT0_ADDR, (REG_RPL_RD(RPL_SEQRXDN_OUT0_ADDR) & ~((uint32_t)0x7FC00000)) | ((uint32_t)rxdnout2 << 22));
}

__INLINE uint16_t rpl_rx_dn_out1_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQRXDN_OUT0_ADDR);
    return ((localVal & ((uint32_t)0x000FF800)) >> 11);
}

__INLINE void rpl_rx_dn_out1_setf(uint16_t rxdnout1)
{
    ASSERT_ERR((((uint32_t)rxdnout1 << 11) & ~((uint32_t)0x000FF800)) == 0);
    REG_RPL_WR(RPL_SEQRXDN_OUT0_ADDR, (REG_RPL_RD(RPL_SEQRXDN_OUT0_ADDR) & ~((uint32_t)0x000FF800)) | ((uint32_t)rxdnout1 << 11));
}

__INLINE uint16_t rpl_rx_dn_out0_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQRXDN_OUT0_ADDR);
    return ((localVal & ((uint32_t)0x000001FF)) >> 0);
}

__INLINE void rpl_rx_dn_out0_setf(uint16_t rxdnout0)
{
    ASSERT_ERR((((uint32_t)rxdnout0 << 0) & ~((uint32_t)0x000001FF)) == 0);
    REG_RPL_WR(RPL_SEQRXDN_OUT0_ADDR, (REG_RPL_RD(RPL_SEQRXDN_OUT0_ADDR) & ~((uint32_t)0x000001FF)) | ((uint32_t)rxdnout0 << 0));
}

/**
 * @brief SEQRXDN_OUT1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  30:22           RX_DN_OUT5   0x0
 *  19:11           RX_DN_OUT4   0x0
 *  08:00           RX_DN_OUT3   0x1
 * </pre>
 */
#define RPL_SEQRXDN_OUT1_ADDR   0x00000019
#define RPL_SEQRXDN_OUT1_OFFSET 0x00000019
#define RPL_SEQRXDN_OUT1_INDEX  0x00000019
#define RPL_SEQRXDN_OUT1_RESET  0x00000001

