yangchengxcy/da14580/xcy_gump/src/modules/rf/api/reg_ripple.h
__INLINE uint8_t rpl_rpll_ivco_buf_trim_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x03000000)) >> 24);
}

__INLINE void rpl_rpll_ivco_buf_trim_setf(uint8_t rpllivcobuftrim)
{
    ASSERT_ERR((((uint32_t)rpllivcobuftrim << 24) & ~((uint32_t)0x03000000)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL1_ADDR, (REG_RPL_RD(RPL_RPLLCNTL1_ADDR) & ~((uint32_t)0x03000000)) | ((uint32_t)rpllivcobuftrim << 24));
}

__INLINE uint8_t rpl_rpll_vcorefbackup_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00400000)) >> 22);
}

__INLINE void rpl_rpll_vcorefbackup_en_setf(uint8_t rpllvcorefbackupen)
{
    ASSERT_ERR((((uint32_t)rpllvcorefbackupen << 22) & ~((uint32_t)0x00400000)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL1_ADDR, (REG_RPL_RD(RPL_RPLLCNTL1_ADDR) & ~((uint32_t)0x00400000)) | ((uint32_t)rpllvcorefbackupen << 22));
}

__INLINE uint8_t rpl_rpll_nref_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00100000)) >> 20);
}

__INLINE void rpl_rpll_nref_setf(uint8_t rpllnref)
{
    ASSERT_ERR((((uint32_t)rpllnref << 20) & ~((uint32_t)0x00100000)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL1_ADDR, (REG_RPL_RD(RPL_RPLLCNTL1_ADDR) & ~((uint32_t)0x00100000)) | ((uint32_t)rpllnref << 20));
}

__INLINE uint8_t rpl_rpll_cp_test_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00070000)) >> 16);
}

__INLINE void rpl_rpll_cp_test_setf(uint8_t rpllcptest)
{
    ASSERT_ERR((((uint32_t)rpllcptest << 16) & ~((uint32_t)0x00070000)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL1_ADDR, (REG_RPL_RD(RPL_RPLLCNTL1_ADDR) & ~((uint32_t)0x00070000)) | ((uint32_t)rpllcptest << 16));
}

__INLINE uint8_t rpl_rpll_icp_offset_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00007000)) >> 12);
}

__INLINE void rpl_rpll_icp_offset_setf(uint8_t rpllicpoffset)
{
    ASSERT_ERR((((uint32_t)rpllicpoffset << 12) & ~((uint32_t)0x00007000)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL1_ADDR, (REG_RPL_RD(RPL_RPLLCNTL1_ADDR) & ~((uint32_t)0x00007000)) | ((uint32_t)rpllicpoffset << 12));
}

__INLINE uint8_t rpl_rpll_icp_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00000F00)) >> 8);
}

__INLINE void rpl_rpll_icp_setf(uint8_t rpllicp)
{
    ASSERT_ERR((((uint32_t)rpllicp << 8) & ~((uint32_t)0x00000F00)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL1_ADDR, (REG_RPL_RD(RPL_RPLLCNTL1_ADDR) & ~((uint32_t)0x00000F00)) | ((uint32_t)rpllicp << 8));
}

__INLINE uint8_t rpl_rpll_vcofc_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x000000F0)) >> 4);
}

__INLINE void rpl_rpll_vcofc_setf(uint8_t rpllvcofc)
{
    ASSERT_ERR((((uint32_t)rpllvcofc << 4) & ~((uint32_t)0x000000F0)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL1_ADDR, (REG_RPL_RD(RPL_RPLLCNTL1_ADDR) & ~((uint32_t)0x000000F0)) | ((uint32_t)rpllvcofc << 4));
}

__INLINE uint8_t rpl_rpll_ivco_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x0000000C)) >> 2);
}

__INLINE void rpl_rpll_ivco_setf(uint8_t rpllivco)
{
    ASSERT_ERR((((uint32_t)rpllivco << 2) & ~((uint32_t)0x0000000C)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL1_ADDR, (REG_RPL_RD(RPL_RPLLCNTL1_ADDR) & ~((uint32_t)0x0000000C)) | ((uint32_t)rpllivco << 2));
}

__INLINE uint8_t rpl_rpll_vco_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00000003)) >> 0);
}

__INLINE void rpl_rpll_vco_mode_setf(uint8_t rpllvcomode)
{
    ASSERT_ERR((((uint32_t)rpllvcomode << 0) & ~((uint32_t)0x00000003)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL1_ADDR, (REG_RPL_RD(RPL_RPLLCNTL1_ADDR) & ~((uint32_t)0x00000003)) | ((uint32_t)rpllvcomode << 0));
}

/**
 * @brief RPLLCNTL2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     21   RPLL_LD_FREF_INV_EN   0
 *     20   RPLL_LD_FDIV_INV_EN   0
 *  19:18      RPLL_EDGES_COMP   0x2
 *     17   RPLL_FE_DETECT_VAL   0
 *     16   RPLL_RE_DETECT_VAL   0
 *  11:08      RPLL_UNLOCK_CNT   0x3
 *  07:00        RPLL_LOCK_CNT   0x46
 * </pre>
 */
#define RPL_RPLLCNTL2_ADDR   0x0000001E
#define RPL_RPLLCNTL2_OFFSET 0x0000001E
#define RPL_RPLLCNTL2_INDEX  0x0000001E
#define RPL_RPLLCNTL2_RESET  0x00080346

__INLINE uint32_t rpl_rpllcntl2_get(void)
{
    return REG_RPL_RD(RPL_RPLLCNTL2_ADDR);
}

__INLINE void rpl_rpllcntl2_set(uint32_t value)
{
    REG_RPL_WR(RPL_RPLLCNTL2_ADDR, value);
}

// field definitions
#define RPL_RPLL_LD_FREF_INV_EN_BIT    ((uint32_t)0x00200000)
#define RPL_RPLL_LD_FREF_INV_EN_POS    21
#define RPL_RPLL_LD_FDIV_INV_EN_BIT    ((uint32_t)0x00100000)
#define RPL_RPLL_LD_FDIV_INV_EN_POS    20
#define RPL_RPLL_EDGES_COMP_MASK       ((uint32_t)0x000C0000)
#define RPL_RPLL_EDGES_COMP_LSB        18
#define RPL_RPLL_EDGES_COMP_WIDTH      ((uint32_t)0x00000002)
#define RPL_RPLL_FE_DETECT_VAL_BIT     ((uint32_t)0x00020000)
#define RPL_RPLL_FE_DETECT_VAL_POS     17
#define RPL_RPLL_RE_DETECT_VAL_BIT     ((uint32_t)0x00010000)
#define RPL_RPLL_RE_DETECT_VAL_POS     16
#define RPL_RPLL_UNLOCK_CNT_MASK       ((uint32_t)0x00000F00)
#define RPL_RPLL_UNLOCK_CNT_LSB        8
#define RPL_RPLL_UNLOCK_CNT_WIDTH      ((uint32_t)0x00000004)
#define RPL_RPLL_LOCK_CNT_MASK         ((uint32_t)0x000000FF)
#define RPL_RPLL_LOCK_CNT_LSB          0
#define RPL_RPLL_LOCK_CNT_WIDTH        ((uint32_t)0x00000008)

#define RPL_RPLL_LD_FREF_INV_EN_RST    0x0
#define RPL_RPLL_LD_FDIV_INV_EN_RST    0x0
#define RPL_RPLL_EDGES_COMP_RST        0x2
#define RPL_RPLL_FE_DETECT_VAL_RST     0x0
#define RPL_RPLL_RE_DETECT_VAL_RST     0x0
#define RPL_RPLL_UNLOCK_CNT_RST        0x3
#define RPL_RPLL_LOCK_CNT_RST          0x46

__INLINE void rpl_rpllcntl2_pack(uint8_t rpllldfrefinven, uint8_t rpllldfdivinven, uint8_t rplledgescomp, uint8_t rpllfedetectval, uint8_t rpllredetectval, uint8_t rpllunlockcnt, uint8_t rplllockcnt)
{
    ASSERT_ERR((((uint32_t)rpllldfrefinven << 21) & ~((uint32_t)0x00200000)) == 0);
    ASSERT_ERR((((uint32_t)rpllldfdivinven << 20) & ~((uint32_t)0x00100000)) == 0);
    ASSERT_ERR((((uint32_t)rplledgescomp << 18) & ~((uint32_t)0x000C0000)) == 0);
    ASSERT_ERR((((uint32_t)rpllfedetectval << 17) & ~((uint32_t)0x00020000)) == 0);
    ASSERT_ERR((((uint32_t)rpllredetectval << 16) & ~((uint32_t)0x00010000)) == 0);
    ASSERT_ERR((((uint32_t)rpllunlockcnt << 8) & ~((uint32_t)0x00000F00)) == 0);
    ASSERT_ERR((((uint32_t)rplllockcnt << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL2_ADDR,  ((uint32_t)rpllldfrefinven << 21) | ((uint32_t)rpllldfdivinven << 20) | ((uint32_t)rplledgescomp << 18) | ((uint32_t)rpllfedetectval << 17) | ((uint32_t)rpllredetectval << 16) | ((uint32_t)rpllunlockcnt << 8) | ((uint32_t)rplllockcnt << 0));
}

