yangchengxcy/da14580/xcy_gump/src/modules/rf/api/reg_ripple.h
__INLINE void rpl_rpllcntl2_unpack(uint8_t* rpllldfrefinven, uint8_t* rpllldfdivinven, uint8_t* rplledgescomp, uint8_t* rpllfedetectval, uint8_t* rpllredetectval, uint8_t* rpllunlockcnt, uint8_t* rplllockcnt)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL2_ADDR);

    *rpllldfrefinven = (localVal & ((uint32_t)0x00200000)) >> 21;
    *rpllldfdivinven = (localVal & ((uint32_t)0x00100000)) >> 20;
    *rplledgescomp = (localVal & ((uint32_t)0x000C0000)) >> 18;
    *rpllfedetectval = (localVal & ((uint32_t)0x00020000)) >> 17;
    *rpllredetectval = (localVal & ((uint32_t)0x00010000)) >> 16;
    *rpllunlockcnt = (localVal & ((uint32_t)0x00000F00)) >> 8;
    *rplllockcnt = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t rpl_rpll_ld_fref_inv_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00200000)) >> 21);
}

__INLINE void rpl_rpll_ld_fref_inv_en_setf(uint8_t rpllldfrefinven)
{
    ASSERT_ERR((((uint32_t)rpllldfrefinven << 21) & ~((uint32_t)0x00200000)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL2_ADDR, (REG_RPL_RD(RPL_RPLLCNTL2_ADDR) & ~((uint32_t)0x00200000)) | ((uint32_t)rpllldfrefinven << 21));
}

__INLINE uint8_t rpl_rpll_ld_fdiv_inv_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00100000)) >> 20);
}

__INLINE void rpl_rpll_ld_fdiv_inv_en_setf(uint8_t rpllldfdivinven)
{
    ASSERT_ERR((((uint32_t)rpllldfdivinven << 20) & ~((uint32_t)0x00100000)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL2_ADDR, (REG_RPL_RD(RPL_RPLLCNTL2_ADDR) & ~((uint32_t)0x00100000)) | ((uint32_t)rpllldfdivinven << 20));
}

__INLINE uint8_t rpl_rpll_edges_comp_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x000C0000)) >> 18);
}

__INLINE void rpl_rpll_edges_comp_setf(uint8_t rplledgescomp)
{
    ASSERT_ERR((((uint32_t)rplledgescomp << 18) & ~((uint32_t)0x000C0000)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL2_ADDR, (REG_RPL_RD(RPL_RPLLCNTL2_ADDR) & ~((uint32_t)0x000C0000)) | ((uint32_t)rplledgescomp << 18));
}

__INLINE uint8_t rpl_rpll_fe_detect_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00020000)) >> 17);
}

__INLINE void rpl_rpll_fe_detect_val_setf(uint8_t rpllfedetectval)
{
    ASSERT_ERR((((uint32_t)rpllfedetectval << 17) & ~((uint32_t)0x00020000)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL2_ADDR, (REG_RPL_RD(RPL_RPLLCNTL2_ADDR) & ~((uint32_t)0x00020000)) | ((uint32_t)rpllfedetectval << 17));
}

__INLINE uint8_t rpl_rpll_re_detect_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00010000)) >> 16);
}

__INLINE void rpl_rpll_re_detect_val_setf(uint8_t rpllredetectval)
{
    ASSERT_ERR((((uint32_t)rpllredetectval << 16) & ~((uint32_t)0x00010000)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL2_ADDR, (REG_RPL_RD(RPL_RPLLCNTL2_ADDR) & ~((uint32_t)0x00010000)) | ((uint32_t)rpllredetectval << 16));
}

__INLINE uint8_t rpl_rpll_unlock_cnt_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00000F00)) >> 8);
}

__INLINE void rpl_rpll_unlock_cnt_setf(uint8_t rpllunlockcnt)
{
    ASSERT_ERR((((uint32_t)rpllunlockcnt << 8) & ~((uint32_t)0x00000F00)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL2_ADDR, (REG_RPL_RD(RPL_RPLLCNTL2_ADDR) & ~((uint32_t)0x00000F00)) | ((uint32_t)rpllunlockcnt << 8));
}

__INLINE uint8_t rpl_rpll_lock_cnt_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void rpl_rpll_lock_cnt_setf(uint8_t rplllockcnt)
{
    ASSERT_ERR((((uint32_t)rplllockcnt << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL2_ADDR, (REG_RPL_RD(RPL_RPLLCNTL2_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)rplllockcnt << 0));
}

/**
 * @brief RFPLLSTAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:20       RPLL_LOCNT_VAL   0x0
 *     03      RPLL_LOCNT_DONE   0
 *     01        FIFO_OVERFLOW   0
 *     00          RPLL_LOCKED   0
 * </pre>
 */
#define RPL_RFPLLSTAT_ADDR   0x0000001F
#define RPL_RFPLLSTAT_OFFSET 0x0000001F
#define RPL_RFPLLSTAT_INDEX  0x0000001F
#define RPL_RFPLLSTAT_RESET  0x00000000

__INLINE uint32_t rpl_rfpllstat_get(void)
{
    return REG_RPL_RD(RPL_RFPLLSTAT_ADDR);
}

// field definitions
#define RPL_RPLL_LOCNT_VAL_MASK    ((uint32_t)0xFFF00000)
#define RPL_RPLL_LOCNT_VAL_LSB     20
#define RPL_RPLL_LOCNT_VAL_WIDTH   ((uint32_t)0x0000000C)
#define RPL_RPLL_LOCNT_DONE_BIT    ((uint32_t)0x00000008)
#define RPL_RPLL_LOCNT_DONE_POS    3
#define RPL_FIFO_OVERFLOW_BIT      ((uint32_t)0x00000002)
#define RPL_FIFO_OVERFLOW_POS      1
#define RPL_RPLL_LOCKED_BIT        ((uint32_t)0x00000001)
#define RPL_RPLL_LOCKED_POS        0

#define RPL_RPLL_LOCNT_VAL_RST     0x0
#define RPL_RPLL_LOCNT_DONE_RST    0x0
#define RPL_FIFO_OVERFLOW_RST      0x0
#define RPL_RPLL_LOCKED_RST        0x0

__INLINE void rpl_rfpllstat_unpack(uint16_t* rplllocntval, uint8_t* rplllocntdone, uint8_t* fifooverflow, uint8_t* rplllocked)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPLLSTAT_ADDR);

    *rplllocntval = (localVal & ((uint32_t)0xFFF00000)) >> 20;
    *rplllocntdone = (localVal & ((uint32_t)0x00000008)) >> 3;
    *fifooverflow = (localVal & ((uint32_t)0x00000002)) >> 1;
    *rplllocked = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint16_t rpl_rpll_locnt_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPLLSTAT_ADDR);
    return ((localVal & ((uint32_t)0xFFF00000)) >> 20);
}

__INLINE uint8_t rpl_rpll_locnt_done_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPLLSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__INLINE uint8_t rpl_fifo_overflow_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPLLSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

