yangchengxcy/da14580/xcy_gump/src/modules/rf/api/reg_ripple.h
__INLINE uint8_t rpl_rpll_locked_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPLLSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

/**
 * @brief RPLLSDCNTL0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:08         RPLL_N0FRACT   0x627627
 *  07:00           RPLL_N0INT   0x5C
 * </pre>
 */
#define RPL_RPLLSDCNTL0_ADDR   0x00000020
#define RPL_RPLLSDCNTL0_OFFSET 0x00000020
#define RPL_RPLLSDCNTL0_INDEX  0x00000020
#define RPL_RPLLSDCNTL0_RESET  0x6276275C

__INLINE uint32_t rpl_rpllsdcntl0_get(void)
{
    return REG_RPL_RD(RPL_RPLLSDCNTL0_ADDR);
}

__INLINE void rpl_rpllsdcntl0_set(uint32_t value)
{
    REG_RPL_WR(RPL_RPLLSDCNTL0_ADDR, value);
}

// field definitions
#define RPL_RPLL_N0FRACT_MASK   ((uint32_t)0xFFFFFF00)
#define RPL_RPLL_N0FRACT_LSB    8
#define RPL_RPLL_N0FRACT_WIDTH  ((uint32_t)0x00000018)
#define RPL_RPLL_N0INT_MASK     ((uint32_t)0x000000FF)
#define RPL_RPLL_N0INT_LSB      0
#define RPL_RPLL_N0INT_WIDTH    ((uint32_t)0x00000008)

#define RPL_RPLL_N0FRACT_RST    0x627627
#define RPL_RPLL_N0INT_RST      0x5C

__INLINE void rpl_rpllsdcntl0_pack(uint32_t rplln0fract, uint8_t rplln0int)
{
    ASSERT_ERR((((uint32_t)rplln0fract << 8) & ~((uint32_t)0xFFFFFF00)) == 0);
    ASSERT_ERR((((uint32_t)rplln0int << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_RPLLSDCNTL0_ADDR,  ((uint32_t)rplln0fract << 8) | ((uint32_t)rplln0int << 0));
}

__INLINE void rpl_rpllsdcntl0_unpack(uint32_t* rplln0fract, uint8_t* rplln0int)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLSDCNTL0_ADDR);

    *rplln0fract = (localVal & ((uint32_t)0xFFFFFF00)) >> 8;
    *rplln0int = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint32_t rpl_rpll_n0fract_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLSDCNTL0_ADDR);
    return ((localVal & ((uint32_t)0xFFFFFF00)) >> 8);
}

__INLINE void rpl_rpll_n0fract_setf(uint32_t rplln0fract)
{
    ASSERT_ERR((((uint32_t)rplln0fract << 8) & ~((uint32_t)0xFFFFFF00)) == 0);
    REG_RPL_WR(RPL_RPLLSDCNTL0_ADDR, (REG_RPL_RD(RPL_RPLLSDCNTL0_ADDR) & ~((uint32_t)0xFFFFFF00)) | ((uint32_t)rplln0fract << 8));
}

__INLINE uint8_t rpl_rpll_n0int_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLSDCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void rpl_rpll_n0int_setf(uint8_t rplln0int)
{
    ASSERT_ERR((((uint32_t)rplln0int << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_RPLLSDCNTL0_ADDR, (REG_RPL_RD(RPL_RPLLSDCNTL0_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)rplln0int << 0));
}

/**
 * @brief RPLLSDCNTL1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  23:00         RPLL_CHFRACT   0x9D89D
 * </pre>
 */
#define RPL_RPLLSDCNTL1_ADDR   0x00000021
#define RPL_RPLLSDCNTL1_OFFSET 0x00000021
#define RPL_RPLLSDCNTL1_INDEX  0x00000021
#define RPL_RPLLSDCNTL1_RESET  0x0009D89D

__INLINE uint32_t rpl_rpllsdcntl1_get(void)
{
    return REG_RPL_RD(RPL_RPLLSDCNTL1_ADDR);
}

__INLINE void rpl_rpllsdcntl1_set(uint32_t value)
{
    REG_RPL_WR(RPL_RPLLSDCNTL1_ADDR, value);
}

// field definitions
#define RPL_RPLL_CHFRACT_MASK   ((uint32_t)0x00FFFFFF)
#define RPL_RPLL_CHFRACT_LSB    0
#define RPL_RPLL_CHFRACT_WIDTH  ((uint32_t)0x00000018)

#define RPL_RPLL_CHFRACT_RST    0x9D89D

__INLINE uint32_t rpl_rpll_chfract_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLSDCNTL1_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x00FFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rpl_rpll_chfract_setf(uint32_t rpllchfract)
{
    ASSERT_ERR((((uint32_t)rpllchfract << 0) & ~((uint32_t)0x00FFFFFF)) == 0);
    REG_RPL_WR(RPL_RPLLSDCNTL1_ADDR, (uint32_t)rpllchfract << 0);
}

/**
 * @brief RPLLSDCNTL2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31         BTLE_DUMO_EN   1
 *  23:16   BTLE_FILTER_SCALING   0x2F
 *  15:08       FILTER_SCALING   0x47
 *     05            FMTX2P_EN   0
 *     04              FMTX_EN   1
 *     03          SDDITHER_EN   1
 *  02:01         RPLL_SDORDER   0x3
 *     00         RPLL_FRAC_EN   1
 * </pre>
 */
#define RPL_RPLLSDCNTL2_ADDR   0x00000022
#define RPL_RPLLSDCNTL2_OFFSET 0x00000022
#define RPL_RPLLSDCNTL2_INDEX  0x00000022
#define RPL_RPLLSDCNTL2_RESET  0x802F471F

__INLINE uint32_t rpl_rpllsdcntl2_get(void)
{
    return REG_RPL_RD(RPL_RPLLSDCNTL2_ADDR);
}

__INLINE void rpl_rpllsdcntl2_set(uint32_t value)
{
    REG_RPL_WR(RPL_RPLLSDCNTL2_ADDR, value);
}

// field definitions
#define RPL_BTLE_DUMO_EN_BIT           ((uint32_t)0x80000000)
#define RPL_BTLE_DUMO_EN_POS           31
#define RPL_BTLE_FILTER_SCALING_MASK   ((uint32_t)0x00FF0000)
#define RPL_BTLE_FILTER_SCALING_LSB    16
#define RPL_BTLE_FILTER_SCALING_WIDTH  ((uint32_t)0x00000008)
#define RPL_FILTER_SCALING_MASK        ((uint32_t)0x0000FF00)
#define RPL_FILTER_SCALING_LSB         8
#define RPL_FILTER_SCALING_WIDTH       ((uint32_t)0x00000008)
#define RPL_FMTX2P_EN_BIT              ((uint32_t)0x00000020)
#define RPL_FMTX2P_EN_POS              5
#define RPL_FMTX_EN_BIT                ((uint32_t)0x00000010)
#define RPL_FMTX_EN_POS                4
#define RPL_SDDITHER_EN_BIT            ((uint32_t)0x00000008)
#define RPL_SDDITHER_EN_POS            3
#define RPL_RPLL_SDORDER_MASK          ((uint32_t)0x00000006)
#define RPL_RPLL_SDORDER_LSB           1
#define RPL_RPLL_SDORDER_WIDTH         ((uint32_t)0x00000002)
#define RPL_RPLL_FRAC_EN_BIT           ((uint32_t)0x00000001)
#define RPL_RPLL_FRAC_EN_POS           0

#define RPL_BTLE_DUMO_EN_RST           0x1
#define RPL_BTLE_FILTER_SCALING_RST    0x2F
#define RPL_FILTER_SCALING_RST         0x47
#define RPL_FMTX2P_EN_RST              0x0
#define RPL_FMTX_EN_RST                0x1
#define RPL_SDDITHER_EN_RST            0x1
#define RPL_RPLL_SDORDER_RST           0x3
#define RPL_RPLL_FRAC_EN_RST           0x1

__INLINE void rpl_rpllsdcntl2_pack(uint8_t btledumoen, uint8_t btlefilterscaling, uint8_t filterscaling, uint8_t fmtx2pen, uint8_t fmtxen, uint8_t sdditheren, uint8_t rpllsdorder, uint8_t rpllfracen)
{
    ASSERT_ERR((((uint32_t)btledumoen << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)btlefilterscaling << 16) & ~((uint32_t)0x00FF0000)) == 0);
    ASSERT_ERR((((uint32_t)filterscaling << 8) & ~((uint32_t)0x0000FF00)) == 0);
    ASSERT_ERR((((uint32_t)fmtx2pen << 5) & ~((uint32_t)0x00000020)) == 0);
    ASSERT_ERR((((uint32_t)fmtxen << 4) & ~((uint32_t)0x00000010)) == 0);
    ASSERT_ERR((((uint32_t)sdditheren << 3) & ~((uint32_t)0x00000008)) == 0);
    ASSERT_ERR((((uint32_t)rpllsdorder << 1) & ~((uint32_t)0x00000006)) == 0);
    ASSERT_ERR((((uint32_t)rpllfracen << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_RPLLSDCNTL2_ADDR,  ((uint32_t)btledumoen << 31) | ((uint32_t)btlefilterscaling << 16) | ((uint32_t)filterscaling << 8) | ((uint32_t)fmtx2pen << 5) | ((uint32_t)fmtxen << 4) | ((uint32_t)sdditheren << 3) | ((uint32_t)rpllsdorder << 1) | ((uint32_t)rpllfracen << 0));
}

