yangchengxcy/da14580/xcy_gump/src/modules/rf/api/reg_ripple.h
__INLINE uint8_t rpl_dpll_fract_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE void rpl_dpll_fract_en_setf(uint8_t dpllfracten)
{
    ASSERT_ERR((((uint32_t)dpllfracten << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL2_ADDR, (REG_RPL_RD(RPL_DPLLCNTL2_ADDR) & ~((uint32_t)0x00000002)) | ((uint32_t)dpllfracten << 1));
}

__INLINE uint8_t rpl_dpll_dtp_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void rpl_dpll_dtp_en_setf(uint8_t dplldtpen)
{
    ASSERT_ERR((((uint32_t)dplldtpen << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL2_ADDR, (REG_RPL_RD(RPL_DPLLCNTL2_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)dplldtpen << 0));
}

/**
 * @brief DPLLCNTL3 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     21   DPLL_LD_FREF_CLK_INV_EN   0
 *     20   DPLL_LD_FDIV_CLK_INV_EN   0
 *  19:18   DPLL_LD_EDGES_COMB   0x2
 *     17           DPLL_LD_FE   0
 *     16           DPLL_LD_RE   0
 *  15:08   DPLL_LD_UNLOCK_CNT   0x5
 *  07:00     DPLL_LD_LOCK_CNT   0xFF
 * </pre>
 */
#define RPL_DPLLCNTL3_ADDR   0x00000035
#define RPL_DPLLCNTL3_OFFSET 0x00000035
#define RPL_DPLLCNTL3_INDEX  0x00000035
#define RPL_DPLLCNTL3_RESET  0x000805FF

__INLINE uint32_t rpl_dpllcntl3_get(void)
{
    return REG_RPL_RD(RPL_DPLLCNTL3_ADDR);
}

__INLINE void rpl_dpllcntl3_set(uint32_t value)
{
    REG_RPL_WR(RPL_DPLLCNTL3_ADDR, value);
}

// field definitions
#define RPL_DPLL_LD_FREF_CLK_INV_EN_BIT    ((uint32_t)0x00200000)
#define RPL_DPLL_LD_FREF_CLK_INV_EN_POS    21
#define RPL_DPLL_LD_FDIV_CLK_INV_EN_BIT    ((uint32_t)0x00100000)
#define RPL_DPLL_LD_FDIV_CLK_INV_EN_POS    20
#define RPL_DPLL_LD_EDGES_COMB_MASK        ((uint32_t)0x000C0000)
#define RPL_DPLL_LD_EDGES_COMB_LSB         18
#define RPL_DPLL_LD_EDGES_COMB_WIDTH       ((uint32_t)0x00000002)
#define RPL_DPLL_LD_FE_BIT                 ((uint32_t)0x00020000)
#define RPL_DPLL_LD_FE_POS                 17
#define RPL_DPLL_LD_RE_BIT                 ((uint32_t)0x00010000)
#define RPL_DPLL_LD_RE_POS                 16
#define RPL_DPLL_LD_UNLOCK_CNT_MASK        ((uint32_t)0x0000FF00)
#define RPL_DPLL_LD_UNLOCK_CNT_LSB         8
#define RPL_DPLL_LD_UNLOCK_CNT_WIDTH       ((uint32_t)0x00000008)
#define RPL_DPLL_LD_LOCK_CNT_MASK          ((uint32_t)0x000000FF)
#define RPL_DPLL_LD_LOCK_CNT_LSB           0
#define RPL_DPLL_LD_LOCK_CNT_WIDTH         ((uint32_t)0x00000008)

#define RPL_DPLL_LD_FREF_CLK_INV_EN_RST    0x0
#define RPL_DPLL_LD_FDIV_CLK_INV_EN_RST    0x0
#define RPL_DPLL_LD_EDGES_COMB_RST         0x2
#define RPL_DPLL_LD_FE_RST                 0x0
#define RPL_DPLL_LD_RE_RST                 0x0
#define RPL_DPLL_LD_UNLOCK_CNT_RST         0x5
#define RPL_DPLL_LD_LOCK_CNT_RST           0xFF

__INLINE void rpl_dpllcntl3_pack(uint8_t dpllldfrefclkinven, uint8_t dpllldfdivclkinven, uint8_t dpllldedgescomb, uint8_t dpllldfe, uint8_t dpllldre, uint8_t dpllldunlockcnt, uint8_t dpllldlockcnt)
{
    ASSERT_ERR((((uint32_t)dpllldfrefclkinven << 21) & ~((uint32_t)0x00200000)) == 0);
    ASSERT_ERR((((uint32_t)dpllldfdivclkinven << 20) & ~((uint32_t)0x00100000)) == 0);
    ASSERT_ERR((((uint32_t)dpllldedgescomb << 18) & ~((uint32_t)0x000C0000)) == 0);
    ASSERT_ERR((((uint32_t)dpllldfe << 17) & ~((uint32_t)0x00020000)) == 0);
    ASSERT_ERR((((uint32_t)dpllldre << 16) & ~((uint32_t)0x00010000)) == 0);
    ASSERT_ERR((((uint32_t)dpllldunlockcnt << 8) & ~((uint32_t)0x0000FF00)) == 0);
    ASSERT_ERR((((uint32_t)dpllldlockcnt << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL3_ADDR,  ((uint32_t)dpllldfrefclkinven << 21) | ((uint32_t)dpllldfdivclkinven << 20) | ((uint32_t)dpllldedgescomb << 18) | ((uint32_t)dpllldfe << 17) | ((uint32_t)dpllldre << 16) | ((uint32_t)dpllldunlockcnt << 8) | ((uint32_t)dpllldlockcnt << 0));
}

__INLINE void rpl_dpllcntl3_unpack(uint8_t* dpllldfrefclkinven, uint8_t* dpllldfdivclkinven, uint8_t* dpllldedgescomb, uint8_t* dpllldfe, uint8_t* dpllldre, uint8_t* dpllldunlockcnt, uint8_t* dpllldlockcnt)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL3_ADDR);

    *dpllldfrefclkinven = (localVal & ((uint32_t)0x00200000)) >> 21;
    *dpllldfdivclkinven = (localVal & ((uint32_t)0x00100000)) >> 20;
    *dpllldedgescomb = (localVal & ((uint32_t)0x000C0000)) >> 18;
    *dpllldfe = (localVal & ((uint32_t)0x00020000)) >> 17;
    *dpllldre = (localVal & ((uint32_t)0x00010000)) >> 16;
    *dpllldunlockcnt = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *dpllldlockcnt = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t rpl_dpll_ld_fref_clk_inv_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x00200000)) >> 21);
}

__INLINE void rpl_dpll_ld_fref_clk_inv_en_setf(uint8_t dpllldfrefclkinven)
{
    ASSERT_ERR((((uint32_t)dpllldfrefclkinven << 21) & ~((uint32_t)0x00200000)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL3_ADDR, (REG_RPL_RD(RPL_DPLLCNTL3_ADDR) & ~((uint32_t)0x00200000)) | ((uint32_t)dpllldfrefclkinven << 21));
}

__INLINE uint8_t rpl_dpll_ld_fdiv_clk_inv_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x00100000)) >> 20);
}

__INLINE void rpl_dpll_ld_fdiv_clk_inv_en_setf(uint8_t dpllldfdivclkinven)
{
    ASSERT_ERR((((uint32_t)dpllldfdivclkinven << 20) & ~((uint32_t)0x00100000)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL3_ADDR, (REG_RPL_RD(RPL_DPLLCNTL3_ADDR) & ~((uint32_t)0x00100000)) | ((uint32_t)dpllldfdivclkinven << 20));
}

__INLINE uint8_t rpl_dpll_ld_edges_comb_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x000C0000)) >> 18);
}

__INLINE void rpl_dpll_ld_edges_comb_setf(uint8_t dpllldedgescomb)
{
    ASSERT_ERR((((uint32_t)dpllldedgescomb << 18) & ~((uint32_t)0x000C0000)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL3_ADDR, (REG_RPL_RD(RPL_DPLLCNTL3_ADDR) & ~((uint32_t)0x000C0000)) | ((uint32_t)dpllldedgescomb << 18));
}

