yangchengxcy/da14580/xcy_gump/src/modules/rf/api/reg_ripple.h
__INLINE void rpl_lut_vcofc_icp_wen_setf(uint8_t lutvcofcicpwen)
{
    ASSERT_ERR((((uint32_t)lutvcofcicpwen << 7) & ~((uint32_t)0x00000080)) == 0);
    REG_RPL_WR(RPL_VCOFC_ICP_CALIBCNTL_ADDR, (REG_RPL_RD(RPL_VCOFC_ICP_CALIBCNTL_ADDR) & ~((uint32_t)0x00000080)) | ((uint32_t)lutvcofcicpwen << 7));
}

__INLINE uint8_t rpl_lut_vcofc_icp_add_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_VCOFC_ICP_CALIBCNTL_ADDR);
    return ((localVal & ((uint32_t)0x0000007F)) >> 0);
}

__INLINE void rpl_lut_vcofc_icp_add_setf(uint8_t lutvcofcicpadd)
{
    ASSERT_ERR((((uint32_t)lutvcofcicpadd << 0) & ~((uint32_t)0x0000007F)) == 0);
    REG_RPL_WR(RPL_VCOFC_ICP_CALIBCNTL_ADDR, (REG_RPL_RD(RPL_VCOFC_ICP_CALIBCNTL_ADDR) & ~((uint32_t)0x0000007F)) | ((uint32_t)lutvcofcicpadd << 0));
}

/**
 * @brief VCOFC_ICP_CALIBCONFIG register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  26:24         KVCOSTEP_DEN   0x6
 *  23:16         KVCOSTEP_NUM   0x3
 *     12           ICPCALSIGN   0
 *  09:00             KVCO_REF   0x1AB
 * </pre>
 */
#define RPL_VCOFC_ICP_CALIBCONFIG_ADDR   0x0000003B
#define RPL_VCOFC_ICP_CALIBCONFIG_OFFSET 0x0000003B
#define RPL_VCOFC_ICP_CALIBCONFIG_INDEX  0x0000003B
#define RPL_VCOFC_ICP_CALIBCONFIG_RESET  0x060301AB

__INLINE uint32_t rpl_vcofc_icp_calibconfig_get(void)
{
    return REG_RPL_RD(RPL_VCOFC_ICP_CALIBCONFIG_ADDR);
}

__INLINE void rpl_vcofc_icp_calibconfig_set(uint32_t value)
{
    REG_RPL_WR(RPL_VCOFC_ICP_CALIBCONFIG_ADDR, value);
}

// field definitions
#define RPL_KVCOSTEP_DEN_MASK   ((uint32_t)0x07000000)
#define RPL_KVCOSTEP_DEN_LSB    24
#define RPL_KVCOSTEP_DEN_WIDTH  ((uint32_t)0x00000003)
#define RPL_KVCOSTEP_NUM_MASK   ((uint32_t)0x00FF0000)
#define RPL_KVCOSTEP_NUM_LSB    16
#define RPL_KVCOSTEP_NUM_WIDTH  ((uint32_t)0x00000008)
#define RPL_ICPCALSIGN_BIT      ((uint32_t)0x00001000)
#define RPL_ICPCALSIGN_POS      12
#define RPL_KVCO_REF_MASK       ((uint32_t)0x000003FF)
#define RPL_KVCO_REF_LSB        0
#define RPL_KVCO_REF_WIDTH      ((uint32_t)0x0000000A)

#define RPL_KVCOSTEP_DEN_RST    0x6
#define RPL_KVCOSTEP_NUM_RST    0x3
#define RPL_ICPCALSIGN_RST      0x0
#define RPL_KVCO_REF_RST        0x1AB

__INLINE void rpl_vcofc_icp_calibconfig_pack(uint8_t kvcostepden, uint8_t kvcostepnum, uint8_t icpcalsign, uint16_t kvcoref)
{
    ASSERT_ERR((((uint32_t)kvcostepden << 24) & ~((uint32_t)0x07000000)) == 0);
    ASSERT_ERR((((uint32_t)kvcostepnum << 16) & ~((uint32_t)0x00FF0000)) == 0);
    ASSERT_ERR((((uint32_t)icpcalsign << 12) & ~((uint32_t)0x00001000)) == 0);
    ASSERT_ERR((((uint32_t)kvcoref << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_VCOFC_ICP_CALIBCONFIG_ADDR,  ((uint32_t)kvcostepden << 24) | ((uint32_t)kvcostepnum << 16) | ((uint32_t)icpcalsign << 12) | ((uint32_t)kvcoref << 0));
}

__INLINE void rpl_vcofc_icp_calibconfig_unpack(uint8_t* kvcostepden, uint8_t* kvcostepnum, uint8_t* icpcalsign, uint16_t* kvcoref)
{
    uint32_t localVal = REG_RPL_RD(RPL_VCOFC_ICP_CALIBCONFIG_ADDR);

    *kvcostepden = (localVal & ((uint32_t)0x07000000)) >> 24;
    *kvcostepnum = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *icpcalsign = (localVal & ((uint32_t)0x00001000)) >> 12;
    *kvcoref = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__INLINE uint8_t rpl_kvcostep_den_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_VCOFC_ICP_CALIBCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x07000000)) >> 24);
}

__INLINE void rpl_kvcostep_den_setf(uint8_t kvcostepden)
{
    ASSERT_ERR((((uint32_t)kvcostepden << 24) & ~((uint32_t)0x07000000)) == 0);
    REG_RPL_WR(RPL_VCOFC_ICP_CALIBCONFIG_ADDR, (REG_RPL_RD(RPL_VCOFC_ICP_CALIBCONFIG_ADDR) & ~((uint32_t)0x07000000)) | ((uint32_t)kvcostepden << 24));
}

__INLINE uint8_t rpl_kvcostep_num_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_VCOFC_ICP_CALIBCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

__INLINE void rpl_kvcostep_num_setf(uint8_t kvcostepnum)
{
    ASSERT_ERR((((uint32_t)kvcostepnum << 16) & ~((uint32_t)0x00FF0000)) == 0);
    REG_RPL_WR(RPL_VCOFC_ICP_CALIBCONFIG_ADDR, (REG_RPL_RD(RPL_VCOFC_ICP_CALIBCONFIG_ADDR) & ~((uint32_t)0x00FF0000)) | ((uint32_t)kvcostepnum << 16));
}

__INLINE uint8_t rpl_icpcalsign_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_VCOFC_ICP_CALIBCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x00001000)) >> 12);
}

__INLINE void rpl_icpcalsign_setf(uint8_t icpcalsign)
{
    ASSERT_ERR((((uint32_t)icpcalsign << 12) & ~((uint32_t)0x00001000)) == 0);
    REG_RPL_WR(RPL_VCOFC_ICP_CALIBCONFIG_ADDR, (REG_RPL_RD(RPL_VCOFC_ICP_CALIBCONFIG_ADDR) & ~((uint32_t)0x00001000)) | ((uint32_t)icpcalsign << 12));
}

__INLINE uint16_t rpl_kvco_ref_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_VCOFC_ICP_CALIBCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

__INLINE void rpl_kvco_ref_setf(uint16_t kvcoref)
{
    ASSERT_ERR((((uint32_t)kvcoref << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_VCOFC_ICP_CALIBCONFIG_ADDR, (REG_RPL_RD(RPL_VCOFC_ICP_CALIBCONFIG_ADDR) & ~((uint32_t)0x000003FF)) | ((uint32_t)kvcoref << 0));
}

/**
 * @brief VCOFC_ICP_CALIBSTAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     08           LUT_LD_VAL   0
 *  07:04          LUT_ICP_VAL   0x0
 *  03:00        LUT_VCOFC_VAL   0x0
 * </pre>
 */
#define RPL_VCOFC_ICP_CALIBSTAT_ADDR   0x0000003C
#define RPL_VCOFC_ICP_CALIBSTAT_OFFSET 0x0000003C
#define RPL_VCOFC_ICP_CALIBSTAT_INDEX  0x0000003C
#define RPL_VCOFC_ICP_CALIBSTAT_RESET  0x00000000

__INLINE uint32_t rpl_vcofc_icp_calibstat_get(void)
{
    return REG_RPL_RD(RPL_VCOFC_ICP_CALIBSTAT_ADDR);
}

// field definitions
#define RPL_LUT_LD_VAL_BIT       ((uint32_t)0x00000100)
#define RPL_LUT_LD_VAL_POS       8
#define RPL_LUT_ICP_VAL_MASK     ((uint32_t)0x000000F0)
#define RPL_LUT_ICP_VAL_LSB      4
#define RPL_LUT_ICP_VAL_WIDTH    ((uint32_t)0x00000004)
#define RPL_LUT_VCOFC_VAL_MASK   ((uint32_t)0x0000000F)
#define RPL_LUT_VCOFC_VAL_LSB    0
#define RPL_LUT_VCOFC_VAL_WIDTH  ((uint32_t)0x00000004)

