yangchengxcy/da14580/xcy_gump/src/modules/rf/api/reg_ripple.h
#define RPL_LUT_LD_VAL_RST       0x0
#define RPL_LUT_ICP_VAL_RST      0x0
#define RPL_LUT_VCOFC_VAL_RST    0x0

__INLINE void rpl_vcofc_icp_calibstat_unpack(uint8_t* lutldval, uint8_t* luticpval, uint8_t* lutvcofcval)
{
    uint32_t localVal = REG_RPL_RD(RPL_VCOFC_ICP_CALIBSTAT_ADDR);

    *lutldval = (localVal & ((uint32_t)0x00000100)) >> 8;
    *luticpval = (localVal & ((uint32_t)0x000000F0)) >> 4;
    *lutvcofcval = (localVal & ((uint32_t)0x0000000F)) >> 0;
}

__INLINE uint8_t rpl_lut_ld_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_VCOFC_ICP_CALIBSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

__INLINE uint8_t rpl_lut_icp_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_VCOFC_ICP_CALIBSTAT_ADDR);
    return ((localVal & ((uint32_t)0x000000F0)) >> 4);
}

__INLINE uint8_t rpl_lut_vcofc_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_VCOFC_ICP_CALIBSTAT_ADDR);
    return ((localVal & ((uint32_t)0x0000000F)) >> 0);
}

/**
 * @brief TXDC_CALIBCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  30:28         LUT_TXDC_SEL   0x0
 *  20:16         LUT_TXDCQ_IN   0x0
 *  12:08         LUT_TXDCI_IN   0x0
 *     04         LUT_TXDC_WEN   0
 *  03:00         LUT_TXDC_ADD   0x0
 * </pre>
 */
#define RPL_TXDC_CALIBCNTL_ADDR   0x0000003D
#define RPL_TXDC_CALIBCNTL_OFFSET 0x0000003D
#define RPL_TXDC_CALIBCNTL_INDEX  0x0000003D
#define RPL_TXDC_CALIBCNTL_RESET  0x00000000

__INLINE uint32_t rpl_txdc_calibcntl_get(void)
{
    return REG_RPL_RD(RPL_TXDC_CALIBCNTL_ADDR);
}

__INLINE void rpl_txdc_calibcntl_set(uint32_t value)
{
    REG_RPL_WR(RPL_TXDC_CALIBCNTL_ADDR, value);
}

// field definitions
#define RPL_LUT_TXDC_SEL_MASK   ((uint32_t)0x70000000)
#define RPL_LUT_TXDC_SEL_LSB    28
#define RPL_LUT_TXDC_SEL_WIDTH  ((uint32_t)0x00000003)
#define RPL_LUT_TXDCQ_IN_MASK   ((uint32_t)0x001F0000)
#define RPL_LUT_TXDCQ_IN_LSB    16
#define RPL_LUT_TXDCQ_IN_WIDTH  ((uint32_t)0x00000005)
#define RPL_LUT_TXDCI_IN_MASK   ((uint32_t)0x00001F00)
#define RPL_LUT_TXDCI_IN_LSB    8
#define RPL_LUT_TXDCI_IN_WIDTH  ((uint32_t)0x00000005)
#define RPL_LUT_TXDC_WEN_BIT    ((uint32_t)0x00000010)
#define RPL_LUT_TXDC_WEN_POS    4
#define RPL_LUT_TXDC_ADD_MASK   ((uint32_t)0x0000000F)
#define RPL_LUT_TXDC_ADD_LSB    0
#define RPL_LUT_TXDC_ADD_WIDTH  ((uint32_t)0x00000004)

#define RPL_LUT_TXDC_SEL_RST    0x0
#define RPL_LUT_TXDCQ_IN_RST    0x0
#define RPL_LUT_TXDCI_IN_RST    0x0
#define RPL_LUT_TXDC_WEN_RST    0x0
#define RPL_LUT_TXDC_ADD_RST    0x0

__INLINE void rpl_txdc_calibcntl_pack(uint8_t luttxdcsel, uint8_t luttxdcqin, uint8_t luttxdciin, uint8_t luttxdcwen, uint8_t luttxdcadd)
{
    ASSERT_ERR((((uint32_t)luttxdcsel << 28) & ~((uint32_t)0x70000000)) == 0);
    ASSERT_ERR((((uint32_t)luttxdcqin << 16) & ~((uint32_t)0x001F0000)) == 0);
    ASSERT_ERR((((uint32_t)luttxdciin << 8) & ~((uint32_t)0x00001F00)) == 0);
    ASSERT_ERR((((uint32_t)luttxdcwen << 4) & ~((uint32_t)0x00000010)) == 0);
    ASSERT_ERR((((uint32_t)luttxdcadd << 0) & ~((uint32_t)0x0000000F)) == 0);
    REG_RPL_WR(RPL_TXDC_CALIBCNTL_ADDR,  ((uint32_t)luttxdcsel << 28) | ((uint32_t)luttxdcqin << 16) | ((uint32_t)luttxdciin << 8) | ((uint32_t)luttxdcwen << 4) | ((uint32_t)luttxdcadd << 0));
}

__INLINE void rpl_txdc_calibcntl_unpack(uint8_t* luttxdcsel, uint8_t* luttxdcqin, uint8_t* luttxdciin, uint8_t* luttxdcwen, uint8_t* luttxdcadd)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_CALIBCNTL_ADDR);

    *luttxdcsel = (localVal & ((uint32_t)0x70000000)) >> 28;
    *luttxdcqin = (localVal & ((uint32_t)0x001F0000)) >> 16;
    *luttxdciin = (localVal & ((uint32_t)0x00001F00)) >> 8;
    *luttxdcwen = (localVal & ((uint32_t)0x00000010)) >> 4;
    *luttxdcadd = (localVal & ((uint32_t)0x0000000F)) >> 0;
}

__INLINE uint8_t rpl_lut_txdc_sel_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_CALIBCNTL_ADDR);
    return ((localVal & ((uint32_t)0x70000000)) >> 28);
}

__INLINE void rpl_lut_txdc_sel_setf(uint8_t luttxdcsel)
{
    ASSERT_ERR((((uint32_t)luttxdcsel << 28) & ~((uint32_t)0x70000000)) == 0);
    REG_RPL_WR(RPL_TXDC_CALIBCNTL_ADDR, (REG_RPL_RD(RPL_TXDC_CALIBCNTL_ADDR) & ~((uint32_t)0x70000000)) | ((uint32_t)luttxdcsel << 28));
}

__INLINE uint8_t rpl_lut_txdcq_in_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_CALIBCNTL_ADDR);
    return ((localVal & ((uint32_t)0x001F0000)) >> 16);
}

__INLINE void rpl_lut_txdcq_in_setf(uint8_t luttxdcqin)
{
    ASSERT_ERR((((uint32_t)luttxdcqin << 16) & ~((uint32_t)0x001F0000)) == 0);
    REG_RPL_WR(RPL_TXDC_CALIBCNTL_ADDR, (REG_RPL_RD(RPL_TXDC_CALIBCNTL_ADDR) & ~((uint32_t)0x001F0000)) | ((uint32_t)luttxdcqin << 16));
}

__INLINE uint8_t rpl_lut_txdci_in_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_CALIBCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00001F00)) >> 8);
}

__INLINE void rpl_lut_txdci_in_setf(uint8_t luttxdciin)
{
    ASSERT_ERR((((uint32_t)luttxdciin << 8) & ~((uint32_t)0x00001F00)) == 0);
    REG_RPL_WR(RPL_TXDC_CALIBCNTL_ADDR, (REG_RPL_RD(RPL_TXDC_CALIBCNTL_ADDR) & ~((uint32_t)0x00001F00)) | ((uint32_t)luttxdciin << 8));
}

__INLINE uint8_t rpl_lut_txdc_wen_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_CALIBCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__INLINE void rpl_lut_txdc_wen_setf(uint8_t luttxdcwen)
{
    ASSERT_ERR((((uint32_t)luttxdcwen << 4) & ~((uint32_t)0x00000010)) == 0);
    REG_RPL_WR(RPL_TXDC_CALIBCNTL_ADDR, (REG_RPL_RD(RPL_TXDC_CALIBCNTL_ADDR) & ~((uint32_t)0x00000010)) | ((uint32_t)luttxdcwen << 4));
}

__INLINE uint8_t rpl_lut_txdc_add_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_CALIBCNTL_ADDR);
    return ((localVal & ((uint32_t)0x0000000F)) >> 0);
}

__INLINE void rpl_lut_txdc_add_setf(uint8_t luttxdcadd)
{
    ASSERT_ERR((((uint32_t)luttxdcadd << 0) & ~((uint32_t)0x0000000F)) == 0);
    REG_RPL_WR(RPL_TXDC_CALIBCNTL_ADDR, (REG_RPL_RD(RPL_TXDC_CALIBCNTL_ADDR) & ~((uint32_t)0x0000000F)) | ((uint32_t)luttxdcadd << 0));
}

/**
 * @brief TXDC_CALIBSTAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  29:25   LUT_TXDCQ_8DPSK_VAL   0x0
 *  24:20   LUT_TXDCI_8DPSK_VAL   0x0
 *  19:15   LUT_TXDCQ_DQPSK_VAL   0x0
 *  14:10   LUT_TXDCI_DQPSK_VAL   0x0
 *  09:05   LUT_TXDCQ_GFSK_VAL   0x0
 *  04:00   LUT_TXDCI_GFSK_VAL   0x0
 * </pre>
 */
#define RPL_TXDC_CALIBSTAT_ADDR   0x0000003E
#define RPL_TXDC_CALIBSTAT_OFFSET 0x0000003E
#define RPL_TXDC_CALIBSTAT_INDEX  0x0000003E
#define RPL_TXDC_CALIBSTAT_RESET  0x00000000

__INLINE uint32_t rpl_txdc_calibstat_get(void)
{
    return REG_RPL_RD(RPL_TXDC_CALIBSTAT_ADDR);
}

