yangchengxcy/da14580/xcy_gump/src/modules/rf/api/reg_ripple.h
// field definitions
#define RPL_LUT_TXDCQ_8DPSK_VAL_MASK   ((uint32_t)0x3E000000)
#define RPL_LUT_TXDCQ_8DPSK_VAL_LSB    25
#define RPL_LUT_TXDCQ_8DPSK_VAL_WIDTH  ((uint32_t)0x00000005)
#define RPL_LUT_TXDCI_8DPSK_VAL_MASK   ((uint32_t)0x01F00000)
#define RPL_LUT_TXDCI_8DPSK_VAL_LSB    20
#define RPL_LUT_TXDCI_8DPSK_VAL_WIDTH  ((uint32_t)0x00000005)
#define RPL_LUT_TXDCQ_DQPSK_VAL_MASK   ((uint32_t)0x000F8000)
#define RPL_LUT_TXDCQ_DQPSK_VAL_LSB    15
#define RPL_LUT_TXDCQ_DQPSK_VAL_WIDTH  ((uint32_t)0x00000005)
#define RPL_LUT_TXDCI_DQPSK_VAL_MASK   ((uint32_t)0x00007C00)
#define RPL_LUT_TXDCI_DQPSK_VAL_LSB    10
#define RPL_LUT_TXDCI_DQPSK_VAL_WIDTH  ((uint32_t)0x00000005)
#define RPL_LUT_TXDCQ_GFSK_VAL_MASK    ((uint32_t)0x000003E0)
#define RPL_LUT_TXDCQ_GFSK_VAL_LSB     5
#define RPL_LUT_TXDCQ_GFSK_VAL_WIDTH   ((uint32_t)0x00000005)
#define RPL_LUT_TXDCI_GFSK_VAL_MASK    ((uint32_t)0x0000001F)
#define RPL_LUT_TXDCI_GFSK_VAL_LSB     0
#define RPL_LUT_TXDCI_GFSK_VAL_WIDTH   ((uint32_t)0x00000005)

#define RPL_LUT_TXDCQ_8DPSK_VAL_RST    0x0
#define RPL_LUT_TXDCI_8DPSK_VAL_RST    0x0
#define RPL_LUT_TXDCQ_DQPSK_VAL_RST    0x0
#define RPL_LUT_TXDCI_DQPSK_VAL_RST    0x0
#define RPL_LUT_TXDCQ_GFSK_VAL_RST     0x0
#define RPL_LUT_TXDCI_GFSK_VAL_RST     0x0

__INLINE void rpl_txdc_calibstat_unpack(uint8_t* luttxdcq8dpskval, uint8_t* luttxdci8dpskval, uint8_t* luttxdcqdqpskval, uint8_t* luttxdcidqpskval, uint8_t* luttxdcqgfskval, uint8_t* luttxdcigfskval)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_CALIBSTAT_ADDR);

    *luttxdcq8dpskval = (localVal & ((uint32_t)0x3E000000)) >> 25;
    *luttxdci8dpskval = (localVal & ((uint32_t)0x01F00000)) >> 20;
    *luttxdcqdqpskval = (localVal & ((uint32_t)0x000F8000)) >> 15;
    *luttxdcidqpskval = (localVal & ((uint32_t)0x00007C00)) >> 10;
    *luttxdcqgfskval = (localVal & ((uint32_t)0x000003E0)) >> 5;
    *luttxdcigfskval = (localVal & ((uint32_t)0x0000001F)) >> 0;
}

__INLINE uint8_t rpl_lut_txdcq_8dpsk_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_CALIBSTAT_ADDR);
    return ((localVal & ((uint32_t)0x3E000000)) >> 25);
}

__INLINE uint8_t rpl_lut_txdci_8dpsk_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_CALIBSTAT_ADDR);
    return ((localVal & ((uint32_t)0x01F00000)) >> 20);
}

__INLINE uint8_t rpl_lut_txdcq_dqpsk_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_CALIBSTAT_ADDR);
    return ((localVal & ((uint32_t)0x000F8000)) >> 15);
}

__INLINE uint8_t rpl_lut_txdci_dqpsk_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_CALIBSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00007C00)) >> 10);
}

__INLINE uint8_t rpl_lut_txdcq_gfsk_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_CALIBSTAT_ADDR);
    return ((localVal & ((uint32_t)0x000003E0)) >> 5);
}

__INLINE uint8_t rpl_lut_txdci_gfsk_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_CALIBSTAT_ADDR);
    return ((localVal & ((uint32_t)0x0000001F)) >> 0);
}

/**
 * @brief AGC_RSSI_CONFIG register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31    RXAGC_SATDET_MODE   1
 *  16:12     RSSI_PRELOAD_CNT   0x0
 *  11:08     RSSI_ON_DLYD_CNT   0x0
 *  07:00      AGC_SETTLE_TIME   0x40
 * </pre>
 */
#define RPL_AGC_RSSI_CONFIG_ADDR   0x0000003F
#define RPL_AGC_RSSI_CONFIG_OFFSET 0x0000003F
#define RPL_AGC_RSSI_CONFIG_INDEX  0x0000003F
#define RPL_AGC_RSSI_CONFIG_RESET  0x80000040

__INLINE uint32_t rpl_agc_rssi_config_get(void)
{
    return REG_RPL_RD(RPL_AGC_RSSI_CONFIG_ADDR);
}

__INLINE void rpl_agc_rssi_config_set(uint32_t value)
{
    REG_RPL_WR(RPL_AGC_RSSI_CONFIG_ADDR, value);
}

// field definitions
#define RPL_RXAGC_SATDET_MODE_BIT    ((uint32_t)0x80000000)
#define RPL_RXAGC_SATDET_MODE_POS    31
#define RPL_RSSI_PRELOAD_CNT_MASK    ((uint32_t)0x0001F000)
#define RPL_RSSI_PRELOAD_CNT_LSB     12
#define RPL_RSSI_PRELOAD_CNT_WIDTH   ((uint32_t)0x00000005)
#define RPL_RSSI_ON_DLYD_CNT_MASK    ((uint32_t)0x00000F00)
#define RPL_RSSI_ON_DLYD_CNT_LSB     8
#define RPL_RSSI_ON_DLYD_CNT_WIDTH   ((uint32_t)0x00000004)
#define RPL_AGC_SETTLE_TIME_MASK     ((uint32_t)0x000000FF)
#define RPL_AGC_SETTLE_TIME_LSB      0
#define RPL_AGC_SETTLE_TIME_WIDTH    ((uint32_t)0x00000008)

#define RPL_RXAGC_SATDET_MODE_RST    0x1
#define RPL_RSSI_PRELOAD_CNT_RST     0x0
#define RPL_RSSI_ON_DLYD_CNT_RST     0x0
#define RPL_AGC_SETTLE_TIME_RST      0x40

__INLINE void rpl_agc_rssi_config_pack(uint8_t rxagcsatdetmode, uint8_t rssipreloadcnt, uint8_t rssiondlydcnt, uint8_t agcsettletime)
{
    ASSERT_ERR((((uint32_t)rxagcsatdetmode << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)rssipreloadcnt << 12) & ~((uint32_t)0x0001F000)) == 0);
    ASSERT_ERR((((uint32_t)rssiondlydcnt << 8) & ~((uint32_t)0x00000F00)) == 0);
    ASSERT_ERR((((uint32_t)agcsettletime << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_AGC_RSSI_CONFIG_ADDR,  ((uint32_t)rxagcsatdetmode << 31) | ((uint32_t)rssipreloadcnt << 12) | ((uint32_t)rssiondlydcnt << 8) | ((uint32_t)agcsettletime << 0));
}

__INLINE void rpl_agc_rssi_config_unpack(uint8_t* rxagcsatdetmode, uint8_t* rssipreloadcnt, uint8_t* rssiondlydcnt, uint8_t* agcsettletime)
{
    uint32_t localVal = REG_RPL_RD(RPL_AGC_RSSI_CONFIG_ADDR);

    *rxagcsatdetmode = (localVal & ((uint32_t)0x80000000)) >> 31;
    *rssipreloadcnt = (localVal & ((uint32_t)0x0001F000)) >> 12;
    *rssiondlydcnt = (localVal & ((uint32_t)0x00000F00)) >> 8;
    *agcsettletime = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t rpl_rxagc_satdet_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_AGC_RSSI_CONFIG_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__INLINE void rpl_rxagc_satdet_mode_setf(uint8_t rxagcsatdetmode)
{
    ASSERT_ERR((((uint32_t)rxagcsatdetmode << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_RPL_WR(RPL_AGC_RSSI_CONFIG_ADDR, (REG_RPL_RD(RPL_AGC_RSSI_CONFIG_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)rxagcsatdetmode << 31));
}

