yangchengxcy/da14580/xcy_gump/src/modules/rf/api/reg_ripple.h
// field definitions
#define RPL_LDO_RXTX_TRIM_MASK      ((uint32_t)0x70000000)
#define RPL_LDO_RXTX_TRIM_LSB       28
#define RPL_LDO_RXTX_TRIM_WIDTH     ((uint32_t)0x00000003)
#define RPL_LDO_VDIG_TRIM_MASK      ((uint32_t)0x0E000000)
#define RPL_LDO_VDIG_TRIM_LSB       25
#define RPL_LDO_VDIG_TRIM_WIDTH     ((uint32_t)0x00000003)
#define RPL_LDO_ADDA_TRIM_MASK      ((uint32_t)0x01C00000)
#define RPL_LDO_ADDA_TRIM_LSB       22
#define RPL_LDO_ADDA_TRIM_WIDTH     ((uint32_t)0x00000003)
#define RPL_LDO_VCO_TRIM_MASK       ((uint32_t)0x00380000)
#define RPL_LDO_VCO_TRIM_LSB        19
#define RPL_LDO_VCO_TRIM_WIDTH      ((uint32_t)0x00000003)
#define RPL_LDO_XO_TRIM_MASK        ((uint32_t)0x00070000)
#define RPL_LDO_XO_TRIM_LSB         16
#define RPL_LDO_XO_TRIM_WIDTH       ((uint32_t)0x00000003)
#define RPL_LDO_PLL_TRIM_MASK       ((uint32_t)0x0000E000)
#define RPL_LDO_PLL_TRIM_LSB        13
#define RPL_LDO_PLL_TRIM_WIDTH      ((uint32_t)0x00000003)
#define RPL_LDO_BGAP_TRIM_MASK      ((uint32_t)0x00001C00)
#define RPL_LDO_BGAP_TRIM_LSB       10
#define RPL_LDO_BGAP_TRIM_WIDTH     ((uint32_t)0x00000003)
#define RPL_LDO_RXTX_LP_MODE_BIT    ((uint32_t)0x00000200)
#define RPL_LDO_RXTX_LP_MODE_POS    9
#define RPL_LDA_ADDA_LP_MODE_BIT    ((uint32_t)0x00000100)
#define RPL_LDA_ADDA_LP_MODE_POS    8
#define RPL_LDO_VCO_LP_MODE_BIT     ((uint32_t)0x00000080)
#define RPL_LDO_VCO_LP_MODE_POS     7
#define RPL_LDO_PLL_LP_MODE_BIT     ((uint32_t)0x00000040)
#define RPL_LDO_PLL_LP_MODE_POS     6
#define RPL_LDO_XO_LP_MODE_BIT      ((uint32_t)0x00000020)
#define RPL_LDO_XO_LP_MODE_POS      5
#define RPL_LDO_RXTX_ON_BIT         ((uint32_t)0x00000010)
#define RPL_LDO_RXTX_ON_POS         4
#define RPL_LDO_ADDA_ON_BIT         ((uint32_t)0x00000008)
#define RPL_LDO_ADDA_ON_POS         3
#define RPL_LDO_VCO_ON_BIT          ((uint32_t)0x00000004)
#define RPL_LDO_VCO_ON_POS          2
#define RPL_LDO_PLL_ON_BIT          ((uint32_t)0x00000002)
#define RPL_LDO_PLL_ON_POS          1
#define RPL_LDO_XO_ON_BIT           ((uint32_t)0x00000001)
#define RPL_LDO_XO_ON_POS           0

#define RPL_LDO_RXTX_TRIM_RST       0x0
#define RPL_LDO_VDIG_TRIM_RST       0x0
#define RPL_LDO_ADDA_TRIM_RST       0x0
#define RPL_LDO_VCO_TRIM_RST        0x0
#define RPL_LDO_XO_TRIM_RST         0x0
#define RPL_LDO_PLL_TRIM_RST        0x0
#define RPL_LDO_BGAP_TRIM_RST       0x0
#define RPL_LDO_RXTX_LP_MODE_RST    0x0
#define RPL_LDA_ADDA_LP_MODE_RST    0x0
#define RPL_LDO_VCO_LP_MODE_RST     0x0
#define RPL_LDO_PLL_LP_MODE_RST     0x0
#define RPL_LDO_XO_LP_MODE_RST      0x0
#define RPL_LDO_RXTX_ON_RST         0x0
#define RPL_LDO_ADDA_ON_RST         0x0
#define RPL_LDO_VCO_ON_RST          0x0
#define RPL_LDO_PLL_ON_RST          0x0
#define RPL_LDO_XO_ON_RST           0x1

__INLINE void rpl_rfpower_cntl_pack(uint8_t ldorxtxtrim, uint8_t ldovdigtrim, uint8_t ldoaddatrim, uint8_t ldovcotrim, uint8_t ldoxotrim, uint8_t ldoplltrim, uint8_t ldobgaptrim, uint8_t ldorxtxlpmode, uint8_t ldaaddalpmode, uint8_t ldovcolpmode, uint8_t ldoplllpmode, uint8_t ldoxolpmode, uint8_t ldorxtxon, uint8_t ldoaddaon, uint8_t ldovcoon, uint8_t ldopllon, uint8_t ldoxoon)
{
    ASSERT_ERR((((uint32_t)ldorxtxtrim << 28) & ~((uint32_t)0x70000000)) == 0);
    ASSERT_ERR((((uint32_t)ldovdigtrim << 25) & ~((uint32_t)0x0E000000)) == 0);
    ASSERT_ERR((((uint32_t)ldoaddatrim << 22) & ~((uint32_t)0x01C00000)) == 0);
    ASSERT_ERR((((uint32_t)ldovcotrim << 19) & ~((uint32_t)0x00380000)) == 0);
    ASSERT_ERR((((uint32_t)ldoxotrim << 16) & ~((uint32_t)0x00070000)) == 0);
    ASSERT_ERR((((uint32_t)ldoplltrim << 13) & ~((uint32_t)0x0000E000)) == 0);
    ASSERT_ERR((((uint32_t)ldobgaptrim << 10) & ~((uint32_t)0x00001C00)) == 0);
    ASSERT_ERR((((uint32_t)ldorxtxlpmode << 9) & ~((uint32_t)0x00000200)) == 0);
    ASSERT_ERR((((uint32_t)ldaaddalpmode << 8) & ~((uint32_t)0x00000100)) == 0);
    ASSERT_ERR((((uint32_t)ldovcolpmode << 7) & ~((uint32_t)0x00000080)) == 0);
    ASSERT_ERR((((uint32_t)ldoplllpmode << 6) & ~((uint32_t)0x00000040)) == 0);
    ASSERT_ERR((((uint32_t)ldoxolpmode << 5) & ~((uint32_t)0x00000020)) == 0);
    ASSERT_ERR((((uint32_t)ldorxtxon << 4) & ~((uint32_t)0x00000010)) == 0);
    ASSERT_ERR((((uint32_t)ldoaddaon << 3) & ~((uint32_t)0x00000008)) == 0);
    ASSERT_ERR((((uint32_t)ldovcoon << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)ldopllon << 1) & ~((uint32_t)0x00000002)) == 0);
    ASSERT_ERR((((uint32_t)ldoxoon << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR,  ((uint32_t)ldorxtxtrim << 28) | ((uint32_t)ldovdigtrim << 25) | ((uint32_t)ldoaddatrim << 22) | ((uint32_t)ldovcotrim << 19) | ((uint32_t)ldoxotrim << 16) | ((uint32_t)ldoplltrim << 13) | ((uint32_t)ldobgaptrim << 10) | ((uint32_t)ldorxtxlpmode << 9) | ((uint32_t)ldaaddalpmode << 8) | ((uint32_t)ldovcolpmode << 7) | ((uint32_t)ldoplllpmode << 6) | ((uint32_t)ldoxolpmode << 5) | ((uint32_t)ldorxtxon << 4) | ((uint32_t)ldoaddaon << 3) | ((uint32_t)ldovcoon << 2) | ((uint32_t)ldopllon << 1) | ((uint32_t)ldoxoon << 0));
}

__INLINE void rpl_rfpower_cntl_unpack(uint8_t* ldorxtxtrim, uint8_t* ldovdigtrim, uint8_t* ldoaddatrim, uint8_t* ldovcotrim, uint8_t* ldoxotrim, uint8_t* ldoplltrim, uint8_t* ldobgaptrim, uint8_t* ldorxtxlpmode, uint8_t* ldaaddalpmode, uint8_t* ldovcolpmode, uint8_t* ldoplllpmode, uint8_t* ldoxolpmode, uint8_t* ldorxtxon, uint8_t* ldoaddaon, uint8_t* ldovcoon, uint8_t* ldopllon, uint8_t* ldoxoon)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);

    *ldorxtxtrim = (localVal & ((uint32_t)0x70000000)) >> 28;
    *ldovdigtrim = (localVal & ((uint32_t)0x0E000000)) >> 25;
    *ldoaddatrim = (localVal & ((uint32_t)0x01C00000)) >> 22;
    *ldovcotrim = (localVal & ((uint32_t)0x00380000)) >> 19;
    *ldoxotrim = (localVal & ((uint32_t)0x00070000)) >> 16;
    *ldoplltrim = (localVal & ((uint32_t)0x0000E000)) >> 13;
    *ldobgaptrim = (localVal & ((uint32_t)0x00001C00)) >> 10;
    *ldorxtxlpmode = (localVal & ((uint32_t)0x00000200)) >> 9;
    *ldaaddalpmode = (localVal & ((uint32_t)0x00000100)) >> 8;
    *ldovcolpmode = (localVal & ((uint32_t)0x00000080)) >> 7;
    *ldoplllpmode = (localVal & ((uint32_t)0x00000040)) >> 6;
    *ldoxolpmode = (localVal & ((uint32_t)0x00000020)) >> 5;
    *ldorxtxon = (localVal & ((uint32_t)0x00000010)) >> 4;
    *ldoaddaon = (localVal & ((uint32_t)0x00000008)) >> 3;
    *ldovcoon = (localVal & ((uint32_t)0x00000004)) >> 2;
    *ldopllon = (localVal & ((uint32_t)0x00000002)) >> 1;
    *ldoxoon = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t rpl_ldo_rxtx_trim_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x70000000)) >> 28);
}

