yangchengxcy/da14580/xcy_gump/src/modules/rf/api/reg_ripple.h
__INLINE uint8_t rpl_ldo_vco_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__INLINE void rpl_ldo_vco_on_setf(uint8_t ldovcoon)
{
    ASSERT_ERR((((uint32_t)ldovcoon << 2) & ~((uint32_t)0x00000004)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x00000004)) | ((uint32_t)ldovcoon << 2));
}

__INLINE uint8_t rpl_ldo_pll_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE void rpl_ldo_pll_on_setf(uint8_t ldopllon)
{
    ASSERT_ERR((((uint32_t)ldopllon << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x00000002)) | ((uint32_t)ldopllon << 1));
}

__INLINE uint8_t rpl_ldo_xo_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void rpl_ldo_xo_on_setf(uint8_t ldoxoon)
{
    ASSERT_ERR((((uint32_t)ldoxoon << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)ldoxoon << 0));
}

/**
 * @brief RAMPGENCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:30             EPC_MODE   0x0
 *  28:20       EDR_SWITCH_CNT   0xD9
 *  15:08             GAIN_DEC   0x1
 *  07:00            GAIN_INCR   0x1
 * </pre>
 */
#define RPL_RAMPGENCNTL_ADDR   0x00000049
#define RPL_RAMPGENCNTL_OFFSET 0x00000049
#define RPL_RAMPGENCNTL_INDEX  0x00000049
#define RPL_RAMPGENCNTL_RESET  0x0D900101

__INLINE uint32_t rpl_rampgencntl_get(void)
{
    return REG_RPL_RD(RPL_RAMPGENCNTL_ADDR);
}

__INLINE void rpl_rampgencntl_set(uint32_t value)
{
    REG_RPL_WR(RPL_RAMPGENCNTL_ADDR, value);
}

// field definitions
#define RPL_EPC_MODE_MASK         ((uint32_t)0xC0000000)
#define RPL_EPC_MODE_LSB          30
#define RPL_EPC_MODE_WIDTH        ((uint32_t)0x00000002)
#define RPL_EDR_SWITCH_CNT_MASK   ((uint32_t)0x1FF00000)
#define RPL_EDR_SWITCH_CNT_LSB    20
#define RPL_EDR_SWITCH_CNT_WIDTH  ((uint32_t)0x00000009)
#define RPL_GAIN_DEC_MASK         ((uint32_t)0x0000FF00)
#define RPL_GAIN_DEC_LSB          8
#define RPL_GAIN_DEC_WIDTH        ((uint32_t)0x00000008)
#define RPL_GAIN_INCR_MASK        ((uint32_t)0x000000FF)
#define RPL_GAIN_INCR_LSB         0
#define RPL_GAIN_INCR_WIDTH       ((uint32_t)0x00000008)

#define RPL_EPC_MODE_RST          0x0
#define RPL_EDR_SWITCH_CNT_RST    0xD9
#define RPL_GAIN_DEC_RST          0x1
#define RPL_GAIN_INCR_RST         0x1

__INLINE void rpl_rampgencntl_pack(uint8_t epcmode, uint16_t edrswitchcnt, uint8_t gaindec, uint8_t gainincr)
{
    ASSERT_ERR((((uint32_t)epcmode << 30) & ~((uint32_t)0xC0000000)) == 0);
    ASSERT_ERR((((uint32_t)edrswitchcnt << 20) & ~((uint32_t)0x1FF00000)) == 0);
    ASSERT_ERR((((uint32_t)gaindec << 8) & ~((uint32_t)0x0000FF00)) == 0);
    ASSERT_ERR((((uint32_t)gainincr << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_RAMPGENCNTL_ADDR,  ((uint32_t)epcmode << 30) | ((uint32_t)edrswitchcnt << 20) | ((uint32_t)gaindec << 8) | ((uint32_t)gainincr << 0));
}

__INLINE void rpl_rampgencntl_unpack(uint8_t* epcmode, uint16_t* edrswitchcnt, uint8_t* gaindec, uint8_t* gainincr)
{
    uint32_t localVal = REG_RPL_RD(RPL_RAMPGENCNTL_ADDR);

    *epcmode = (localVal & ((uint32_t)0xC0000000)) >> 30;
    *edrswitchcnt = (localVal & ((uint32_t)0x1FF00000)) >> 20;
    *gaindec = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *gainincr = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t rpl_epc_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RAMPGENCNTL_ADDR);
    return ((localVal & ((uint32_t)0xC0000000)) >> 30);
}

__INLINE void rpl_epc_mode_setf(uint8_t epcmode)
{
    ASSERT_ERR((((uint32_t)epcmode << 30) & ~((uint32_t)0xC0000000)) == 0);
    REG_RPL_WR(RPL_RAMPGENCNTL_ADDR, (REG_RPL_RD(RPL_RAMPGENCNTL_ADDR) & ~((uint32_t)0xC0000000)) | ((uint32_t)epcmode << 30));
}

__INLINE uint16_t rpl_edr_switch_cnt_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RAMPGENCNTL_ADDR);
    return ((localVal & ((uint32_t)0x1FF00000)) >> 20);
}

__INLINE void rpl_edr_switch_cnt_setf(uint16_t edrswitchcnt)
{
    ASSERT_ERR((((uint32_t)edrswitchcnt << 20) & ~((uint32_t)0x1FF00000)) == 0);
    REG_RPL_WR(RPL_RAMPGENCNTL_ADDR, (REG_RPL_RD(RPL_RAMPGENCNTL_ADDR) & ~((uint32_t)0x1FF00000)) | ((uint32_t)edrswitchcnt << 20));
}

__INLINE uint8_t rpl_gain_dec_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RAMPGENCNTL_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

__INLINE void rpl_gain_dec_setf(uint8_t gaindec)
{
    ASSERT_ERR((((uint32_t)gaindec << 8) & ~((uint32_t)0x0000FF00)) == 0);
    REG_RPL_WR(RPL_RAMPGENCNTL_ADDR, (REG_RPL_RD(RPL_RAMPGENCNTL_ADDR) & ~((uint32_t)0x0000FF00)) | ((uint32_t)gaindec << 8));
}

__INLINE uint8_t rpl_gain_incr_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RAMPGENCNTL_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void rpl_gain_incr_setf(uint8_t gainincr)
{
    ASSERT_ERR((((uint32_t)gainincr << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_RAMPGENCNTL_ADDR, (REG_RPL_RD(RPL_RAMPGENCNTL_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)gainincr << 0));
}

/**
 * @brief RFTX_GFSK_GAIN_TABLE register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  10:08   TX_GFSK_PAINT_GAIN   0x0
 *  06:04     TX_GFSK_DRV_GAIN   0x1
 *  02:00   TX_GFSK_FILTER_GAIN   0x3
 * </pre>
 */
#define RPL_RFTX_GFSK_GAIN_TABLE_ADDR   0x0000004A
#define RPL_RFTX_GFSK_GAIN_TABLE_OFFSET 0x0000004A
#define RPL_RFTX_GFSK_GAIN_TABLE_INDEX  0x0000004A
#define RPL_RFTX_GFSK_GAIN_TABLE_RESET  0x00000013
#define RPL_RFTX_GFSK_GAIN_TABLE_COUNT  16

__INLINE uint32_t rpl_rftx_gfsk_gain_table_get(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 15);
    return REG_RPL_RD(RPL_RFTX_GFSK_GAIN_TABLE_ADDR + reg_idx * 1);
}

