yangchengxcy/da14580/xcy_gump/src/modules/rf/api/reg_ripple.h
__INLINE void rpl_txdaci_8dpsk_gain_setf(uint8_t txdaci8dpskgain)
{
    ASSERT_ERR((((uint32_t)txdaci8dpskgain << 16) & ~((uint32_t)0x00070000)) == 0);
    REG_RPL_WR(RPL_RFTX_DACIQ_GAIN_ADDR, (REG_RPL_RD(RPL_RFTX_DACIQ_GAIN_ADDR) & ~((uint32_t)0x00070000)) | ((uint32_t)txdaci8dpskgain << 16));
}

__INLINE uint8_t rpl_txdacq_dqpsk_gain_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTX_DACIQ_GAIN_ADDR);
    return ((localVal & ((uint32_t)0x00007000)) >> 12);
}

__INLINE void rpl_txdacq_dqpsk_gain_setf(uint8_t txdacqdqpskgain)
{
    ASSERT_ERR((((uint32_t)txdacqdqpskgain << 12) & ~((uint32_t)0x00007000)) == 0);
    REG_RPL_WR(RPL_RFTX_DACIQ_GAIN_ADDR, (REG_RPL_RD(RPL_RFTX_DACIQ_GAIN_ADDR) & ~((uint32_t)0x00007000)) | ((uint32_t)txdacqdqpskgain << 12));
}

__INLINE uint8_t rpl_txdaci_dqpsk_gain_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTX_DACIQ_GAIN_ADDR);
    return ((localVal & ((uint32_t)0x00000700)) >> 8);
}

__INLINE void rpl_txdaci_dqpsk_gain_setf(uint8_t txdacidqpskgain)
{
    ASSERT_ERR((((uint32_t)txdacidqpskgain << 8) & ~((uint32_t)0x00000700)) == 0);
    REG_RPL_WR(RPL_RFTX_DACIQ_GAIN_ADDR, (REG_RPL_RD(RPL_RFTX_DACIQ_GAIN_ADDR) & ~((uint32_t)0x00000700)) | ((uint32_t)txdacidqpskgain << 8));
}

__INLINE uint8_t rpl_txdacq_gfsk_gain_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTX_DACIQ_GAIN_ADDR);
    return ((localVal & ((uint32_t)0x00000070)) >> 4);
}

__INLINE void rpl_txdacq_gfsk_gain_setf(uint8_t txdacqgfskgain)
{
    ASSERT_ERR((((uint32_t)txdacqgfskgain << 4) & ~((uint32_t)0x00000070)) == 0);
    REG_RPL_WR(RPL_RFTX_DACIQ_GAIN_ADDR, (REG_RPL_RD(RPL_RFTX_DACIQ_GAIN_ADDR) & ~((uint32_t)0x00000070)) | ((uint32_t)txdacqgfskgain << 4));
}

__INLINE uint8_t rpl_txdaci_gfsk_gain_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTX_DACIQ_GAIN_ADDR);
    return ((localVal & ((uint32_t)0x00000007)) >> 0);
}

__INLINE void rpl_txdaci_gfsk_gain_setf(uint8_t txdacigfskgain)
{
    ASSERT_ERR((((uint32_t)txdacigfskgain << 0) & ~((uint32_t)0x00000007)) == 0);
    REG_RPL_WR(RPL_RFTX_DACIQ_GAIN_ADDR, (REG_RPL_RD(RPL_RFTX_DACIQ_GAIN_ADDR) & ~((uint32_t)0x00000007)) | ((uint32_t)txdacigfskgain << 0));
}

/**
 * @brief CRM_CNTL0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31         FORCE_RESETS   0
 *     30    FORCE_CLOCK_GATES   0
 *     28      DAP_TXDC_RST_EN   0
 *     27     RPLL_FDIV_RST_EN   0
 *     26           MDM_RST_EN   0
 *     25            DB_RST_EN   0
 *     24           AGC_RST_EN   0
 *     23            SD_RST_EN   0
 *     22   GFSK_PREFILT_RST_EN   0
 *     21     DAP_CALIB_RST_EN   0
 *     20           DAP_RST_EN   0
 *     18   DAP_TXDC_CLK_GATE_EN   0
 *     17   RPLL_FDIV_CLK_GATE_EN   0
 *     16   SAR_ADC_CLK_GATE_EN   0
 *     15   MDM_TXDPSK13_CLK_GATE_EN   0
 *     14   MDM_TXGFSK13_CLK_GATE_EN   0
 *     13   MDM_TX13_CLK_GATE_EN   0
 *     12   MDM_RXDPSK13_CLK_GATE_EN   0
 *     11   MDM_RXDPSK52_CLK_GATE_EN   0
 *     10   MDM_RXDL13_CLK_GATE_EN   0
 *     09   MDM_RXGFSK13_CLK_GATE_EN   0
 *     08   MDM_RXGFSK52_CLK_GATE_EN   0
 *     07   MDM_RX52_CLK_GATE_EN   0
 *     06   MDM_CORE13_CLK_GATE_EN   0
 *     05       DB_CLK_GATE_EN   0
 *     04      AGC_CLK_GATE_EN   0
 *     03       SD_CLK_GATE_EN   0
 *     02   GFSK_PREFILT_CLK_GATE_EN   0
 *     01   DAP_CALIB_CLK_GATE_EN   0
 *     00      DAP_CLK_GATE_EN   0
 * </pre>
 */
#define RPL_CRM_CNTL0_ADDR   0x0000006B
#define RPL_CRM_CNTL0_OFFSET 0x0000006B
#define RPL_CRM_CNTL0_INDEX  0x0000006B
#define RPL_CRM_CNTL0_RESET  0x00000000

__INLINE uint32_t rpl_crm_cntl0_get(void)
{
    return REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
}

__INLINE void rpl_crm_cntl0_set(uint32_t value)
{
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, value);
}

// field definitions
#define RPL_FORCE_RESETS_BIT                ((uint32_t)0x80000000)
#define RPL_FORCE_RESETS_POS                31
#define RPL_FORCE_CLOCK_GATES_BIT           ((uint32_t)0x40000000)
#define RPL_FORCE_CLOCK_GATES_POS           30
#define RPL_DAP_TXDC_RST_EN_BIT             ((uint32_t)0x10000000)
#define RPL_DAP_TXDC_RST_EN_POS             28
#define RPL_RPLL_FDIV_RST_EN_BIT            ((uint32_t)0x08000000)
#define RPL_RPLL_FDIV_RST_EN_POS            27
#define RPL_MDM_RST_EN_BIT                  ((uint32_t)0x04000000)
#define RPL_MDM_RST_EN_POS                  26
#define RPL_DB_RST_EN_BIT                   ((uint32_t)0x02000000)
#define RPL_DB_RST_EN_POS                   25
#define RPL_AGC_RST_EN_BIT                  ((uint32_t)0x01000000)
#define RPL_AGC_RST_EN_POS                  24
#define RPL_SD_RST_EN_BIT                   ((uint32_t)0x00800000)
#define RPL_SD_RST_EN_POS                   23
#define RPL_GFSK_PREFILT_RST_EN_BIT         ((uint32_t)0x00400000)
#define RPL_GFSK_PREFILT_RST_EN_POS         22
#define RPL_DAP_CALIB_RST_EN_BIT            ((uint32_t)0x00200000)
#define RPL_DAP_CALIB_RST_EN_POS            21
#define RPL_DAP_RST_EN_BIT                  ((uint32_t)0x00100000)
#define RPL_DAP_RST_EN_POS                  20
#define RPL_DAP_TXDC_CLK_GATE_EN_BIT        ((uint32_t)0x00040000)
#define RPL_DAP_TXDC_CLK_GATE_EN_POS        18
#define RPL_RPLL_FDIV_CLK_GATE_EN_BIT       ((uint32_t)0x00020000)
#define RPL_RPLL_FDIV_CLK_GATE_EN_POS       17
#define RPL_SAR_ADC_CLK_GATE_EN_BIT         ((uint32_t)0x00010000)
#define RPL_SAR_ADC_CLK_GATE_EN_POS         16
#define RPL_MDM_TXDPSK13_CLK_GATE_EN_BIT    ((uint32_t)0x00008000)
#define RPL_MDM_TXDPSK13_CLK_GATE_EN_POS    15
#define RPL_MDM_TXGFSK13_CLK_GATE_EN_BIT    ((uint32_t)0x00004000)
#define RPL_MDM_TXGFSK13_CLK_GATE_EN_POS    14
#define RPL_MDM_TX13_CLK_GATE_EN_BIT        ((uint32_t)0x00002000)
#define RPL_MDM_TX13_CLK_GATE_EN_POS        13
#define RPL_MDM_RXDPSK13_CLK_GATE_EN_BIT    ((uint32_t)0x00001000)
#define RPL_MDM_RXDPSK13_CLK_GATE_EN_POS    12
#define RPL_MDM_RXDPSK52_CLK_GATE_EN_BIT    ((uint32_t)0x00000800)
#define RPL_MDM_RXDPSK52_CLK_GATE_EN_POS    11
#define RPL_MDM_RXDL13_CLK_GATE_EN_BIT      ((uint32_t)0x00000400)
#define RPL_MDM_RXDL13_CLK_GATE_EN_POS      10
#define RPL_MDM_RXGFSK13_CLK_GATE_EN_BIT    ((uint32_t)0x00000200)
#define RPL_MDM_RXGFSK13_CLK_GATE_EN_POS    9
#define RPL_MDM_RXGFSK52_CLK_GATE_EN_BIT    ((uint32_t)0x00000100)
#define RPL_MDM_RXGFSK52_CLK_GATE_EN_POS    8
#define RPL_MDM_RX52_CLK_GATE_EN_BIT        ((uint32_t)0x00000080)
#define RPL_MDM_RX52_CLK_GATE_EN_POS        7
#define RPL_MDM_CORE13_CLK_GATE_EN_BIT      ((uint32_t)0x00000040)
#define RPL_MDM_CORE13_CLK_GATE_EN_POS      6
#define RPL_DB_CLK_GATE_EN_BIT              ((uint32_t)0x00000020)
#define RPL_DB_CLK_GATE_EN_POS              5
#define RPL_AGC_CLK_GATE_EN_BIT             ((uint32_t)0x00000010)
#define RPL_AGC_CLK_GATE_EN_POS             4
#define RPL_SD_CLK_GATE_EN_BIT              ((uint32_t)0x00000008)
#define RPL_SD_CLK_GATE_EN_POS              3
#define RPL_GFSK_PREFILT_CLK_GATE_EN_BIT    ((uint32_t)0x00000004)
#define RPL_GFSK_PREFILT_CLK_GATE_EN_POS    2
#define RPL_DAP_CALIB_CLK_GATE_EN_BIT       ((uint32_t)0x00000002)
#define RPL_DAP_CALIB_CLK_GATE_EN_POS       1
#define RPL_DAP_CLK_GATE_EN_BIT             ((uint32_t)0x00000001)
#define RPL_DAP_CLK_GATE_EN_POS             0

#define RPL_FORCE_RESETS_RST                0x0
#define RPL_FORCE_CLOCK_GATES_RST           0x0
#define RPL_DAP_TXDC_RST_EN_RST             0x0
#define RPL_RPLL_FDIV_RST_EN_RST            0x0
#define RPL_MDM_RST_EN_RST                  0x0
#define RPL_DB_RST_EN_RST                   0x0
#define RPL_AGC_RST_EN_RST                  0x0
#define RPL_SD_RST_EN_RST                   0x0
#define RPL_GFSK_PREFILT_RST_EN_RST         0x0
#define RPL_DAP_CALIB_RST_EN_RST            0x0
#define RPL_DAP_RST_EN_RST                  0x0
#define RPL_DAP_TXDC_CLK_GATE_EN_RST        0x0
#define RPL_RPLL_FDIV_CLK_GATE_EN_RST       0x0
#define RPL_SAR_ADC_CLK_GATE_EN_RST         0x0
#define RPL_MDM_TXDPSK13_CLK_GATE_EN_RST    0x0
#define RPL_MDM_TXGFSK13_CLK_GATE_EN_RST    0x0
#define RPL_MDM_TX13_CLK_GATE_EN_RST        0x0
#define RPL_MDM_RXDPSK13_CLK_GATE_EN_RST    0x0
#define RPL_MDM_RXDPSK52_CLK_GATE_EN_RST    0x0
#define RPL_MDM_RXDL13_CLK_GATE_EN_RST      0x0
#define RPL_MDM_RXGFSK13_CLK_GATE_EN_RST    0x0
#define RPL_MDM_RXGFSK52_CLK_GATE_EN_RST    0x0
#define RPL_MDM_RX52_CLK_GATE_EN_RST        0x0
#define RPL_MDM_CORE13_CLK_GATE_EN_RST      0x0
#define RPL_DB_CLK_GATE_EN_RST              0x0
#define RPL_AGC_CLK_GATE_EN_RST             0x0
#define RPL_SD_CLK_GATE_EN_RST              0x0
#define RPL_GFSK_PREFILT_CLK_GATE_EN_RST    0x0
#define RPL_DAP_CALIB_CLK_GATE_EN_RST       0x0
#define RPL_DAP_CLK_GATE_EN_RST             0x0

