yangchengxcy/da14580/xcy_gump/src/modules/rf/api/reg_ripple.h
__INLINE void rpl_rssi_on_setf(uint8_t rssion)
{
    ASSERT_ERR((((uint32_t)rssion << 8) & ~((uint32_t)0x00000100)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x00000100)) | ((uint32_t)rssion << 8));
}

__INLINE uint8_t rpl_rxfilt_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

__INLINE void rpl_rxfilt_on_setf(uint8_t rxfilton)
{
    ASSERT_ERR((((uint32_t)rxfilton << 7) & ~((uint32_t)0x00000080)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x00000080)) | ((uint32_t)rxfilton << 7));
}

__INLINE uint8_t rpl_rxlobuf_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000040)) >> 6);
}

__INLINE void rpl_rxlobuf_on_setf(uint8_t rxlobufon)
{
    ASSERT_ERR((((uint32_t)rxlobufon << 6) & ~((uint32_t)0x00000040)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x00000040)) | ((uint32_t)rxlobufon << 6));
}

__INLINE uint8_t rpl_rxmix_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000020)) >> 5);
}

__INLINE void rpl_rxmix_on_setf(uint8_t rxmixon)
{
    ASSERT_ERR((((uint32_t)rxmixon << 5) & ~((uint32_t)0x00000020)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x00000020)) | ((uint32_t)rxmixon << 5));
}

__INLINE uint8_t rpl_rxlna_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__INLINE void rpl_rxlna_on_setf(uint8_t rxlnaon)
{
    ASSERT_ERR((((uint32_t)rxlnaon << 4) & ~((uint32_t)0x00000010)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x00000010)) | ((uint32_t)rxlnaon << 4));
}

__INLINE uint8_t rpl_rxrf_bias_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__INLINE void rpl_rxrf_bias_on_setf(uint8_t rxrfbiason)
{
    ASSERT_ERR((((uint32_t)rxrfbiason << 3) & ~((uint32_t)0x00000008)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x00000008)) | ((uint32_t)rxrfbiason << 3));
}

__INLINE uint8_t rpl_rxgain_sel_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000007)) >> 0);
}

__INLINE void rpl_rxgain_sel_setf(uint8_t rxgainsel)
{
    ASSERT_ERR((((uint32_t)rxgainsel << 0) & ~((uint32_t)0x00000007)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x00000007)) | ((uint32_t)rxgainsel << 0));
}

/**
 * @brief RFRXCONFIG register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31         RXFILT_IF_EN   1
 *  25:24           RXMIX_TRIM   0x0
 *  23:22           RXLNA_TRIM   0x0
 *  21:20            RXLNA_CFG   0x0
 *  19:16           RXFILT_CFG   0x0
 *  15:08            RXADC_CFG   0x3
 *  07:00             RSSI_CFG   0x3B
 * </pre>
 */
#define RPL_RFRXCONFIG_ADDR   0x0000006E
#define RPL_RFRXCONFIG_OFFSET 0x0000006E
#define RPL_RFRXCONFIG_INDEX  0x0000006E
#define RPL_RFRXCONFIG_RESET  0x8000033B

__INLINE uint32_t rpl_rfrxconfig_get(void)
{
    return REG_RPL_RD(RPL_RFRXCONFIG_ADDR);
}

__INLINE void rpl_rfrxconfig_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFRXCONFIG_ADDR, value);
}

// field definitions
#define RPL_RXFILT_IF_EN_BIT    ((uint32_t)0x80000000)
#define RPL_RXFILT_IF_EN_POS    31
#define RPL_RXMIX_TRIM_MASK     ((uint32_t)0x03000000)
#define RPL_RXMIX_TRIM_LSB      24
#define RPL_RXMIX_TRIM_WIDTH    ((uint32_t)0x00000002)
#define RPL_RXLNA_TRIM_MASK     ((uint32_t)0x00C00000)
#define RPL_RXLNA_TRIM_LSB      22
#define RPL_RXLNA_TRIM_WIDTH    ((uint32_t)0x00000002)
#define RPL_RXLNA_CFG_MASK      ((uint32_t)0x00300000)
#define RPL_RXLNA_CFG_LSB       20
#define RPL_RXLNA_CFG_WIDTH     ((uint32_t)0x00000002)
#define RPL_RXFILT_CFG_MASK     ((uint32_t)0x000F0000)
#define RPL_RXFILT_CFG_LSB      16
#define RPL_RXFILT_CFG_WIDTH    ((uint32_t)0x00000004)
#define RPL_RXADC_CFG_MASK      ((uint32_t)0x0000FF00)
#define RPL_RXADC_CFG_LSB       8
#define RPL_RXADC_CFG_WIDTH     ((uint32_t)0x00000008)
#define RPL_RSSI_CFG_MASK       ((uint32_t)0x000000FF)
#define RPL_RSSI_CFG_LSB        0
#define RPL_RSSI_CFG_WIDTH      ((uint32_t)0x00000008)

#define RPL_RXFILT_IF_EN_RST    0x1
#define RPL_RXMIX_TRIM_RST      0x0
#define RPL_RXLNA_TRIM_RST      0x0
#define RPL_RXLNA_CFG_RST       0x0
#define RPL_RXFILT_CFG_RST      0x0
#define RPL_RXADC_CFG_RST       0x3
#define RPL_RSSI_CFG_RST        0x3B

__INLINE void rpl_rfrxconfig_pack(uint8_t rxfiltifen, uint8_t rxmixtrim, uint8_t rxlnatrim, uint8_t rxlnacfg, uint8_t rxfiltcfg, uint8_t rxadccfg, uint8_t rssicfg)
{
    ASSERT_ERR((((uint32_t)rxfiltifen << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)rxmixtrim << 24) & ~((uint32_t)0x03000000)) == 0);
    ASSERT_ERR((((uint32_t)rxlnatrim << 22) & ~((uint32_t)0x00C00000)) == 0);
    ASSERT_ERR((((uint32_t)rxlnacfg << 20) & ~((uint32_t)0x00300000)) == 0);
    ASSERT_ERR((((uint32_t)rxfiltcfg << 16) & ~((uint32_t)0x000F0000)) == 0);
    ASSERT_ERR((((uint32_t)rxadccfg << 8) & ~((uint32_t)0x0000FF00)) == 0);
    ASSERT_ERR((((uint32_t)rssicfg << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_RFRXCONFIG_ADDR,  ((uint32_t)rxfiltifen << 31) | ((uint32_t)rxmixtrim << 24) | ((uint32_t)rxlnatrim << 22) | ((uint32_t)rxlnacfg << 20) | ((uint32_t)rxfiltcfg << 16) | ((uint32_t)rxadccfg << 8) | ((uint32_t)rssicfg << 0));
}

__INLINE void rpl_rfrxconfig_unpack(uint8_t* rxfiltifen, uint8_t* rxmixtrim, uint8_t* rxlnatrim, uint8_t* rxlnacfg, uint8_t* rxfiltcfg, uint8_t* rxadccfg, uint8_t* rssicfg)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCONFIG_ADDR);

    *rxfiltifen = (localVal & ((uint32_t)0x80000000)) >> 31;
    *rxmixtrim = (localVal & ((uint32_t)0x03000000)) >> 24;
    *rxlnatrim = (localVal & ((uint32_t)0x00C00000)) >> 22;
    *rxlnacfg = (localVal & ((uint32_t)0x00300000)) >> 20;
    *rxfiltcfg = (localVal & ((uint32_t)0x000F0000)) >> 16;
    *rxadccfg = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *rssicfg = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t rpl_rxfilt_if_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__INLINE void rpl_rxfilt_if_en_setf(uint8_t rxfiltifen)
{
    ASSERT_ERR((((uint32_t)rxfiltifen << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_RPL_WR(RPL_RFRXCONFIG_ADDR, (REG_RPL_RD(RPL_RFRXCONFIG_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)rxfiltifen << 31));
}

