yangchengxcy/da14580/xcy_gump/src/modules/rf/api/reg_ripple.h
// field definitions
#define RPL_TXDC_FORCE_BIT    ((uint32_t)0x80000000)
#define RPL_TXDC_FORCE_POS    31
#define RPL_TXDC_Q_MASK       ((uint32_t)0x00001F00)
#define RPL_TXDC_Q_LSB        8
#define RPL_TXDC_Q_WIDTH      ((uint32_t)0x00000005)
#define RPL_TXDC_I_MASK       ((uint32_t)0x0000001F)
#define RPL_TXDC_I_LSB        0
#define RPL_TXDC_I_WIDTH      ((uint32_t)0x00000005)

#define RPL_TXDC_FORCE_RST    0x0
#define RPL_TXDC_Q_RST        0x0
#define RPL_TXDC_I_RST        0x0

__INLINE void rpl_rftxcntl1_pack(uint8_t txdcforce, uint8_t txdcq, uint8_t txdci)
{
    ASSERT_ERR((((uint32_t)txdcforce << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)txdcq << 8) & ~((uint32_t)0x00001F00)) == 0);
    ASSERT_ERR((((uint32_t)txdci << 0) & ~((uint32_t)0x0000001F)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL1_ADDR,  ((uint32_t)txdcforce << 31) | ((uint32_t)txdcq << 8) | ((uint32_t)txdci << 0));
}

__INLINE void rpl_rftxcntl1_unpack(uint8_t* txdcforce, uint8_t* txdcq, uint8_t* txdci)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL1_ADDR);

    *txdcforce = (localVal & ((uint32_t)0x80000000)) >> 31;
    *txdcq = (localVal & ((uint32_t)0x00001F00)) >> 8;
    *txdci = (localVal & ((uint32_t)0x0000001F)) >> 0;
}

__INLINE uint8_t rpl_txdc_force_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__INLINE void rpl_txdc_force_setf(uint8_t txdcforce)
{
    ASSERT_ERR((((uint32_t)txdcforce << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL1_ADDR, (REG_RPL_RD(RPL_RFTXCNTL1_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)txdcforce << 31));
}

__INLINE uint8_t rpl_txdc_q_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00001F00)) >> 8);
}

__INLINE void rpl_txdc_q_setf(uint8_t txdcq)
{
    ASSERT_ERR((((uint32_t)txdcq << 8) & ~((uint32_t)0x00001F00)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL1_ADDR, (REG_RPL_RD(RPL_RFTXCNTL1_ADDR) & ~((uint32_t)0x00001F00)) | ((uint32_t)txdcq << 8));
}

__INLINE uint8_t rpl_txdc_i_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x0000001F)) >> 0);
}

__INLINE void rpl_txdc_i_setf(uint8_t txdci)
{
    ASSERT_ERR((((uint32_t)txdci << 0) & ~((uint32_t)0x0000001F)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL1_ADDR, (REG_RPL_RD(RPL_RFTXCNTL1_ADDR) & ~((uint32_t)0x0000001F)) | ((uint32_t)txdci << 0));
}

/**
 * @brief RFTXCONFIG register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31         TXFILT_IF_EN   1
 *  27:20   TXDC_CAL_TIMEOUT_DELAY   0xFF
 *  19:16   FMTX2P_ON_DLYD_CNT   0x0
 *  15:14            FMTX_TRIM   0x0
 *  13:12           TXMIX_TRIM   0x0
 *  10:08           TXTANK_SEL   0x0
 *  07:04           TXFILT_CFG   0x0
 *  02:00             TXPA_CFG   0x0
 * </pre>
 */
#define RPL_RFTXCONFIG_ADDR   0x00000071
#define RPL_RFTXCONFIG_OFFSET 0x00000071
#define RPL_RFTXCONFIG_INDEX  0x00000071
#define RPL_RFTXCONFIG_RESET  0x8FF00000

__INLINE uint32_t rpl_rftxconfig_get(void)
{
    return REG_RPL_RD(RPL_RFTXCONFIG_ADDR);
}

__INLINE void rpl_rftxconfig_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFTXCONFIG_ADDR, value);
}

// field definitions
#define RPL_TXFILT_IF_EN_BIT              ((uint32_t)0x80000000)
#define RPL_TXFILT_IF_EN_POS              31
#define RPL_TXDC_CAL_TIMEOUT_DELAY_MASK   ((uint32_t)0x0FF00000)
#define RPL_TXDC_CAL_TIMEOUT_DELAY_LSB    20
#define RPL_TXDC_CAL_TIMEOUT_DELAY_WIDTH  ((uint32_t)0x00000008)
#define RPL_FMTX2P_ON_DLYD_CNT_MASK       ((uint32_t)0x000F0000)
#define RPL_FMTX2P_ON_DLYD_CNT_LSB        16
#define RPL_FMTX2P_ON_DLYD_CNT_WIDTH      ((uint32_t)0x00000004)
#define RPL_FMTX_TRIM_MASK                ((uint32_t)0x0000C000)
#define RPL_FMTX_TRIM_LSB                 14
#define RPL_FMTX_TRIM_WIDTH               ((uint32_t)0x00000002)
#define RPL_TXMIX_TRIM_MASK               ((uint32_t)0x00003000)
#define RPL_TXMIX_TRIM_LSB                12
#define RPL_TXMIX_TRIM_WIDTH              ((uint32_t)0x00000002)
#define RPL_TXTANK_SEL_MASK               ((uint32_t)0x00000700)
#define RPL_TXTANK_SEL_LSB                8
#define RPL_TXTANK_SEL_WIDTH              ((uint32_t)0x00000003)
#define RPL_TXFILT_CFG_MASK               ((uint32_t)0x000000F0)
#define RPL_TXFILT_CFG_LSB                4
#define RPL_TXFILT_CFG_WIDTH              ((uint32_t)0x00000004)
#define RPL_TXPA_CFG_MASK                 ((uint32_t)0x00000007)
#define RPL_TXPA_CFG_LSB                  0
#define RPL_TXPA_CFG_WIDTH                ((uint32_t)0x00000003)

#define RPL_TXFILT_IF_EN_RST              0x1
#define RPL_TXDC_CAL_TIMEOUT_DELAY_RST    0xFF
#define RPL_FMTX2P_ON_DLYD_CNT_RST        0x0
#define RPL_FMTX_TRIM_RST                 0x0
#define RPL_TXMIX_TRIM_RST                0x0
#define RPL_TXTANK_SEL_RST                0x0
#define RPL_TXFILT_CFG_RST                0x0
#define RPL_TXPA_CFG_RST                  0x0

__INLINE void rpl_rftxconfig_pack(uint8_t txfiltifen, uint8_t txdccaltimeoutdelay, uint8_t fmtx2pondlydcnt, uint8_t fmtxtrim, uint8_t txmixtrim, uint8_t txtanksel, uint8_t txfiltcfg, uint8_t txpacfg)
{
    ASSERT_ERR((((uint32_t)txfiltifen << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)txdccaltimeoutdelay << 20) & ~((uint32_t)0x0FF00000)) == 0);
    ASSERT_ERR((((uint32_t)fmtx2pondlydcnt << 16) & ~((uint32_t)0x000F0000)) == 0);
    ASSERT_ERR((((uint32_t)fmtxtrim << 14) & ~((uint32_t)0x0000C000)) == 0);
    ASSERT_ERR((((uint32_t)txmixtrim << 12) & ~((uint32_t)0x00003000)) == 0);
    ASSERT_ERR((((uint32_t)txtanksel << 8) & ~((uint32_t)0x00000700)) == 0);
    ASSERT_ERR((((uint32_t)txfiltcfg << 4) & ~((uint32_t)0x000000F0)) == 0);
    ASSERT_ERR((((uint32_t)txpacfg << 0) & ~((uint32_t)0x00000007)) == 0);
    REG_RPL_WR(RPL_RFTXCONFIG_ADDR,  ((uint32_t)txfiltifen << 31) | ((uint32_t)txdccaltimeoutdelay << 20) | ((uint32_t)fmtx2pondlydcnt << 16) | ((uint32_t)fmtxtrim << 14) | ((uint32_t)txmixtrim << 12) | ((uint32_t)txtanksel << 8) | ((uint32_t)txfiltcfg << 4) | ((uint32_t)txpacfg << 0));
}

