yangchengxcy/da14580/xcy_gump/src/modules/rf/api/reg_ripple.h
__INLINE uint8_t rpl_txdcq_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXSTAT_ADDR);
    return ((localVal & ((uint32_t)0x0001F000)) >> 12);
}

__INLINE uint8_t rpl_txdci_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXSTAT_ADDR);
    return ((localVal & ((uint32_t)0x000001F0)) >> 4);
}

__INLINE uint8_t rpl_txdc_cal_dead_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE uint8_t rpl_txdc_cal_done_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

/**
 * @brief RFTXRXCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31       TXRXCTRL_FORCE   0
 *     30   VCOFC_ICP_CAL_FORCE   0
 *     12   VCOFC_CAL_ICP_MODE   0
 *     09      RXMDM_BYPASS_EN   0
 *     08      TXMDM_BYPASS_EN   0
 *     06   RFPLL_CAL_TIMEOUT_DSB   0
 *     05        ICP_CAL_START   0
 *     04      VCOFC_CAL_START   0
 *     02                PD_ON   0
 *     01           BB_BIAS_ON   0
 *     00            LODIV2_ON   0
 * </pre>
 */
#define RPL_RFTXRXCNTL_ADDR   0x00000073
#define RPL_RFTXRXCNTL_OFFSET 0x00000073
#define RPL_RFTXRXCNTL_INDEX  0x00000073
#define RPL_RFTXRXCNTL_RESET  0x00000000

__INLINE uint32_t rpl_rftxrxcntl_get(void)
{
    return REG_RPL_RD(RPL_RFTXRXCNTL_ADDR);
}

__INLINE void rpl_rftxrxcntl_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFTXRXCNTL_ADDR, value);
}

// field definitions
#define RPL_TXRXCTRL_FORCE_BIT           ((uint32_t)0x80000000)
#define RPL_TXRXCTRL_FORCE_POS           31
#define RPL_VCOFC_ICP_CAL_FORCE_BIT      ((uint32_t)0x40000000)
#define RPL_VCOFC_ICP_CAL_FORCE_POS      30
#define RPL_VCOFC_CAL_ICP_MODE_BIT       ((uint32_t)0x00001000)
#define RPL_VCOFC_CAL_ICP_MODE_POS       12
#define RPL_RXMDM_BYPASS_EN_BIT          ((uint32_t)0x00000200)
#define RPL_RXMDM_BYPASS_EN_POS          9
#define RPL_TXMDM_BYPASS_EN_BIT          ((uint32_t)0x00000100)
#define RPL_TXMDM_BYPASS_EN_POS          8
#define RPL_RFPLL_CAL_TIMEOUT_DSB_BIT    ((uint32_t)0x00000040)
#define RPL_RFPLL_CAL_TIMEOUT_DSB_POS    6
#define RPL_ICP_CAL_START_BIT            ((uint32_t)0x00000020)
#define RPL_ICP_CAL_START_POS            5
#define RPL_VCOFC_CAL_START_BIT          ((uint32_t)0x00000010)
#define RPL_VCOFC_CAL_START_POS          4
#define RPL_PD_ON_BIT                    ((uint32_t)0x00000004)
#define RPL_PD_ON_POS                    2
#define RPL_BB_BIAS_ON_BIT               ((uint32_t)0x00000002)
#define RPL_BB_BIAS_ON_POS               1
#define RPL_LODIV2_ON_BIT                ((uint32_t)0x00000001)
#define RPL_LODIV2_ON_POS                0

#define RPL_TXRXCTRL_FORCE_RST           0x0
#define RPL_VCOFC_ICP_CAL_FORCE_RST      0x0
#define RPL_VCOFC_CAL_ICP_MODE_RST       0x0
#define RPL_RXMDM_BYPASS_EN_RST          0x0
#define RPL_TXMDM_BYPASS_EN_RST          0x0
#define RPL_RFPLL_CAL_TIMEOUT_DSB_RST    0x0
#define RPL_ICP_CAL_START_RST            0x0
#define RPL_VCOFC_CAL_START_RST          0x0
#define RPL_PD_ON_RST                    0x0
#define RPL_BB_BIAS_ON_RST               0x0
#define RPL_LODIV2_ON_RST                0x0

__INLINE void rpl_rftxrxcntl_pack(uint8_t txrxctrlforce, uint8_t vcofcicpcalforce, uint8_t vcofccalicpmode, uint8_t rxmdmbypassen, uint8_t txmdmbypassen, uint8_t rfpllcaltimeoutdsb, uint8_t icpcalstart, uint8_t vcofccalstart, uint8_t pdon, uint8_t bbbiason, uint8_t lodiv2on)
{
    ASSERT_ERR((((uint32_t)txrxctrlforce << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)vcofcicpcalforce << 30) & ~((uint32_t)0x40000000)) == 0);
    ASSERT_ERR((((uint32_t)vcofccalicpmode << 12) & ~((uint32_t)0x00001000)) == 0);
    ASSERT_ERR((((uint32_t)rxmdmbypassen << 9) & ~((uint32_t)0x00000200)) == 0);
    ASSERT_ERR((((uint32_t)txmdmbypassen << 8) & ~((uint32_t)0x00000100)) == 0);
    ASSERT_ERR((((uint32_t)rfpllcaltimeoutdsb << 6) & ~((uint32_t)0x00000040)) == 0);
    ASSERT_ERR((((uint32_t)icpcalstart << 5) & ~((uint32_t)0x00000020)) == 0);
    ASSERT_ERR((((uint32_t)vcofccalstart << 4) & ~((uint32_t)0x00000010)) == 0);
    ASSERT_ERR((((uint32_t)pdon << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)bbbiason << 1) & ~((uint32_t)0x00000002)) == 0);
    ASSERT_ERR((((uint32_t)lodiv2on << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_RFTXRXCNTL_ADDR,  ((uint32_t)txrxctrlforce << 31) | ((uint32_t)vcofcicpcalforce << 30) | ((uint32_t)vcofccalicpmode << 12) | ((uint32_t)rxmdmbypassen << 9) | ((uint32_t)txmdmbypassen << 8) | ((uint32_t)rfpllcaltimeoutdsb << 6) | ((uint32_t)icpcalstart << 5) | ((uint32_t)vcofccalstart << 4) | ((uint32_t)pdon << 2) | ((uint32_t)bbbiason << 1) | ((uint32_t)lodiv2on << 0));
}

__INLINE void rpl_rftxrxcntl_unpack(uint8_t* txrxctrlforce, uint8_t* vcofcicpcalforce, uint8_t* vcofccalicpmode, uint8_t* rxmdmbypassen, uint8_t* txmdmbypassen, uint8_t* rfpllcaltimeoutdsb, uint8_t* icpcalstart, uint8_t* vcofccalstart, uint8_t* pdon, uint8_t* bbbiason, uint8_t* lodiv2on)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCNTL_ADDR);

    *txrxctrlforce = (localVal & ((uint32_t)0x80000000)) >> 31;
    *vcofcicpcalforce = (localVal & ((uint32_t)0x40000000)) >> 30;
    *vcofccalicpmode = (localVal & ((uint32_t)0x00001000)) >> 12;
    *rxmdmbypassen = (localVal & ((uint32_t)0x00000200)) >> 9;
    *txmdmbypassen = (localVal & ((uint32_t)0x00000100)) >> 8;
    *rfpllcaltimeoutdsb = (localVal & ((uint32_t)0x00000040)) >> 6;
    *icpcalstart = (localVal & ((uint32_t)0x00000020)) >> 5;
    *vcofccalstart = (localVal & ((uint32_t)0x00000010)) >> 4;
    *pdon = (localVal & ((uint32_t)0x00000004)) >> 2;
    *bbbiason = (localVal & ((uint32_t)0x00000002)) >> 1;
    *lodiv2on = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t rpl_txrxctrl_force_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

